var curcontent = new Array();
curcontent["contacts"] = {
	xhead: 'Наши контакты',
	xcon: `<div style="padding: 0px 10px;">
	<br><br><br>
<div class="store-products contacts-div">
<div class="store-products__item store-products__qritem store-products__qrvk"><a class="product" href="https://vk.com/grandrust_server"><div class="navbar-brand">VK</div><img class="product__image" src="https://i.imgur.com/HwMyBiW.png"><div class="qrcode-card-button">Перейти</div>
</a>
</div>
<div class="store-products__item store-products__qritem store-products__qrds"><a class="product" href="https://discord.com/invite/grandrust"><div class="navbar-brand">Discord</div><img class="product__image" src="https://i.imgur.com/Fj6DpuS.png"><div class="qrcode-card-button">Перейти</div>
</a>
</div>
<div class="store-products__item store-products__qritem store-products__qrtg"><a class="product" href="https://t.me/grandrust_server"><div class="navbar-brand">Telegram</div><img class="product__image" src="https://i.imgur.com/tKgG8x2.png"><div class="qrcode-card-button">Перейти</div>
</a>
</div>
</div>
</div>`
};

curcontent["faq"] = {
	xhead: 'Ответы на популярные вопросы',
	xcon: `<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как часто на сервере вайп?</span><br><blockquote class="spoil-Untext">🌎 Вайп карты каждый четверг в 13:00 МСК<br>📘 Вайп чертежей (глобальный) 2 раза в месяц (Один раз вместе с глобал обновой разработчиков(в первый четверг месяца (но мы проводим его в пятницу 13:00 МСК)), второй через 2 недели после него, тоже в четверг)<br><i class="fa fa-info-circle"></i><span> Возможны внеплановые вайпы любого сервера, по требованию игроков/народного голосования</span><br><i class="fa fa-exclamation-triangle" style="color: #FF0"></i><span> Летом вайпы обычно проходят не в 13:00 а в 11:00 МСК, о чём будут предупреждения в наших постах в ВК</span></blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box">
         <span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Не могу зайти на сервер, EAC Disconnected</span>
         <blockquote class="spoil-Untext">
EAC не идеален и может ошибочно отключать игроков при подключении на сервер. В этом случае есть несколько вариантов решения проблемы:<br><ol class="numbered" style="padding-bottom: 0px; margin-bottom: 0px; padding-left: 30px;"><li style="padding: 4px 0px 4px 3px;"><span class="l">Попробовать зайти ещё раз.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l">Перезапустить игру.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l">Перезапустить Steam.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l" style="">Попробовать позже.</span></li></ol>
         </blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Всё на английском</span><br>
	 <blockquote class="spoil-Untext">Если у вас все сообщения на английском, в том числе ответы от плагинов в чате, включите стандартный язык клиента на русском и перезайдите (или '/lang ru' в чат)</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Другие вопросы</span><br><blockquote class="spoil-Untext">
<b>Вопрос</b>: Когда бывает обновление от разработчиков и зачем оно?<br>
<b>Ответ</b>: Обновление игры и сервера всегда выходит в первый четверг месяца в 22:00 МСК. С каждым обновлением разработчики вводят что-то новое, исправляют недочеты, оптимизируют производительность. Следить за обновлениями вы всегда можете на сайте игры: playrust.com<br><br>
<b>Вопрос</b>: Зачем делать вайп?<br>
<b>Ответ</b>: Это уменьшает лаги, оптимизирует сервер и порой это необходимо в связи с обновлением от разработчиков.<br><br>
<b>Вопрос</b>: Что очищается при вайпе?<br>
<b>Ответ</b>: При обычном вайпе обычно очищаются только постройки и инвентари игроков.<br><br>При глобал вайпе с постройками удаляются ещё и чертежи, данные игроков - такие как различные топы, данные о достижениях игроков в различных системах прокачки и в ивентах. Но могут быть исключения о которых мы пишем зарание в постах в нашей группе!<br>📦 Склад не очищается никогда!<br>Чтобы узнать когда какой вайп см. начало - первый вопрос...<br><br>
<b>Вопрос</b>: Зачем делать рестарт?<br>
<b>Ответ</b>: Рестарт каждые 12 часов нужен для того, чтобы устранить утечку памяти, которая происходит постоянно, когда сервер включен. Также, рестарты избавляют от медленных прогрузок мира и багов с постройками. Обычно рестарт происходит в течение 2-5 минут.<br><br>
<b>Вопрос</b>: Могу ли я зайти с пиратской версии игры?<br>
<b>Ответ</b>: Нет, только лицензионная версия игры.<br><br>
<b>Вопрос</b>: Почему все системные сообщения сервера на английском?<br>
<b>Ответ</b>: Переключите ваш стандартный язык клиента на русский! Любой отличный от русского языка игрок, автоматически получает сообщения на англ. (либо используйте 'lang ru' в консоли F1)</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Что входит в KIT</span><br>
	 <blockquote class="spoil-Untext">Вы можете ознакомится с китами<a href="javascript:;" onclick="Open('kit-free');"> здесь.</a> Либо можете обратится к альбому со скринами в нашей <a href="https://vk.com/album-124254208_233413146" target="blank">группе Вк</a></blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как забиндить команды</span><br>
	 <blockquote class="spoil-Untext"><a href="javascript:;" onclick="Open('help');">Как биндить основные команды на нашем сервере</a></blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как получить бесплатные привилегии</span><br>
	 <blockquote class="spoil-Untext">Вы участвуете в ивентах которые мы настроили на сервере почти на каждый час и получаете классные ресурсы и предметы!<br>
Но вы можете пойти ещё дальше и принять участие в наших уникальных ивентах и получать настоящие платные привилегии из магазина абсолютно бесплатно!<br>
Также вы можете учавствовать в наших супер ивентах которые проходят на протяжении всего месяца и уже получать настоящие деньги на вашу банковскую карту или на баланс магазина!</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Уникальные плагины</span><br>
	 <blockquote class="spoil-Untext">О наших уникальных собственных плагинах вы можете прочитать <a href="javascript:;" onclick="Open('plugins');">здесь</a></blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" onclick="Open('serv');" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Можно подробнее узнать О Серверах?</span><br>
	 <blockquote class="spoil-Untext">- -</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Я купил несколько разных/одинаковых групп, могу ли я их активировать одновременно?</span><br>
	 <blockquote class="spoil-Untext">Да, все группы совместимы друг с другом. Если в группах есть похожие привилегии, но с разными значениями (время тп, рейты), то выбираться будет лучшее.<br>
Если Вы купите и активируете одновременно Prem и Elite, то рейты и время тп у Вас будут от группы Elite. (и не важно, в каком порядке активировать).<br>Откат на киты не сбрасывается!<br><br>
<i class="fa fa-info-circle"></i> Также если вы купили 2 одинаковые группы вы можете либо активировать сначала одну, а через неделю другую. Либо вы можете активировать сразу несколько копий одной группы. Время будет складываться.<br>
<i class="fa fa-info-circle"></i> Откат китов не сбрасывается если вы заново активировали привилегию.</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Можно получить промокод или скидку?</span><br>
	 <blockquote class="spoil-Untext">Промокод может выпускаться на сутки ограниченным тиражом сразу после вайпа. Узнать его можно только подписавшись на уведомления о вайпе в нашей <a href="https://vk.com/grandrust_server?w=app5748831_-124254208" target="blank">группе Вконтакте</a><br><br>
<i class="fa fa-info-circle"></i> Промокод будет приходить вам в личных сообщениях сразу вместе с проведением вайпа, обычно каждый четверг в 13:00 МСК<br><br>
Но в основном промокод получают те, кто первый зашёл на сервер сразу после вайпа (обычно по 50-100 игроков на каждом сервере) и поиграл на сервере 10-20 минут. Вы получите уведомление при переходе по которому Вам перечислят деньги на баланс привязанного аккаунта в магазине<br><br>
<i class="fa fa-info-circle"></i> Внимание! В таком случае аккаунт с которого вы играете должен быть зарегистрирован в магазине! Подробнее о местах/порядке и сроках получения приза мы сообщаем в каждом посте о вайпе в нашей <a href="https://vk.com/grandrust_server" target="blank">группе Вконтакте</a><br><br></blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как забрать предметы на сервере купленные в магазине?</span><br>
	 <blockquote class="spoil-Untext">Откройте корзину на сервере с помощью кнопки в виде корзины <i class="fa fa-box-open"></i> слева вверху экрана или командой /store в чат. Перед Вами появится список всех Ваших покупок. <br><br>
<i class="fa fa-info-circle"></i> Их можно получить только если у вас есть достаточно места в инвентаре для выдачи и только в своей билде!</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Когда вайп внутриигрового склада с ивентов?</span><br>
	 <blockquote class="spoil-Untext">Он не очищается ни на одном сервере! Более того он синхронизирован на любом из наших серверов так, чтобы вы могли забрать ваши накопленные вещи на любом удобном сервере в любой удобный момент, прямо как вещи из магазина.</blockquote>
     </div></div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Я увидел нарушителей, что делать?</span><br>
	 <blockquote class="spoil-Untext">Если вы заметили игроков превышающих лимит в команде либо нарушающих иные правила, пожалуйста, сделайте скрин либо запомните ники игроков и предоставьте нам через группу ВК и через отправку репорта (/report).<br><br>
<i class="fa fa-info-circle"></i> Также, если вас очень смутил, убивший вас, подозреваемый читер, нажмите на соответствующую кнопку report на экране смерти, все ваши заявки очень тщательно рассматриваются нашим патрулём и мы сразу проводим принудительную проверку всех подозреваемых вами игроков</blockquote>
     </div></div>`
};

curcontent["rules"] = {
	xhead: 'Правила',
	xcon: `<div class="xbox_custom_rules">
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Основная информация</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">1.1</td>
    <td class="tg-2lax">Зайдя на сервера Grand Rust, вы автоматически соглашаетесь с соблюдением всех правил проекта. Незнание правил не освобождает вас от ответственности.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.2</td>
    <td class="tg-2lax">Администраторы сервера имеют право изменить или дополнить правила сервера. Изменения правил логируется в discord-сервере проекта.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.3</td>
    <td class="tg-2lax">Проверяющие и администрация сами выбирают наказание для игрока в зависимости от степени нарушения и обстоятельств. Игрок может отделаться простым предупреждением, а может и попасть в бессрочный бан.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.4</td>
    <td class="tg-2lax">Проверяющие и Главная Модерация отвечает только за проверку на стороннее ПО у игроков. Вызов проходит с появлением уведомления у вас на экране, вызовы через чат не производятся.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.5</td>
    <td class="tg-2lax">Игрок несет ответственность за все свои аккаунты. Если вы получили бан на одном аккаунте, вы получите его и на последующих. Если вы имеете игровую блокировку по игре Rust (EAC) на одном из аккаунтов, вы получите бан на проекте по причине "EAC" и на последующих.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.6</td>
    <td class="tg-2lax">Администрация и Главная Модерация имеет право вас забанить без проверки, если на другом проекте, при наличии пруфов, вы уже были замечены с читами/макросами/игровой блокировкой.</td>
  </tr>
  <tr>
    <td class="tg-1lax">1.7</td>
    <td class="tg-2lax">Администрация не компенсирует игровые предметы, утраченные по вашей ошибке, серверных лагов, багов игры или контактом с нарушителями.</td>
  </tr>
</tbody>
</table>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Игровой процесс</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">2.1</td>
    <td class="tg-2lax">Запрещено использовать/хранить/приобретать/распространять стороннее ПО или любые другие средства, позволяющие получить преимущество над другими игроками. Использование услуг читеров/макросников приравнивается к хранению.</td>
  </tr>
  <tr>
    <td class="tg-1lax">2.2</td>
    <td class="tg-2lax">Игрокам запрещено строить дома в текстурах, а так же застраивать игровые локации, препятствующие к использованию РТ.</td>
  </tr>
  <tr>
    <td class="tg-1lax">2.3</td>
    <td class="tg-2lax">Запрещено строиться или хранить лут в текстурах/скалах/камнях и подобных недоработках карт.</td>
  </tr>
  <tr>
    <td class="tg-1lax">2.4</td>
    <td class="tg-2lax">Игрокам запрещено строить игровые постройки и предметы багом/недоработкой например в целях сделать несколько предметов друг в друге, слишком близко или с невозможностью уничтожения.</td>
  </tr>
  <tr>
    <td class="tg-1lax">2.5</td>
    <td class="tg-2lax">Запрещено строить "усы" к дому дальше 10 квадратов в длину (треугольники засчитываются так же). На первый раз игрок может отделаться как предупреждением с последующим самостоятельным уничтожением, либо лишние "усы" или весь дом уничтожает администратор. При повторном нарушении усов (свыше 5 квадратов) дом может подлежать полному уничтожению, либо бану всех хозяев.</td>
  </tr>
  <tr>
    <td class="tg-1lax">2.6</td>
    <td class="tg-2lax">При обнаружении бага или недоработки игры/сервера незамедлительно сообщите администрации об этом через сообщение в нашу <a href="https://vk.com/grandrust_server" target="blank">группу Вконтакте</a><br><br> </td>
  </tr>
</tbody>
</table>
		<br><p style="text-align: center;"><i class="fa fa-info-circle"></i><u> БАН – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Лимит игроков в команде</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">3.1</td>
    <td class="tg-2lax">Запрещено превышать лимит игроков в команде, установленный сервером. (см. название сервера MAX 1/2/3/5).</td>
  </tr>
  <tr>
    <td class="tg-1lax">3.2</td>
    <td class="tg-2lax">Перемирие и альянсы с соседями приравниваются к нарушению правил о лимите, если в сумме вас больше указанного в названии сервера.</td>
  </tr>
  <tr>
    <td class="tg-1lax">3.3</td>
    <td class="tg-2lax">Частая смена напарника приравнивается к нарушению правил о лимите.</td>
  </tr>
  <tr>
    <td class="tg-1lax">3.4</td>
    <td class="tg-2lax">Запрещено рейдить и антирейдить в 1+/2+/3+/5+ (подсад, доп.люди на обороне и любое кооперирование против других игроков).</td>
  </tr>
  <tr>
    <td class="tg-1lax">3.5</td>
    <td class="tg-2lax">Запрещена смена напарника на время, если ваш основной напарник продолжит с вами играть.</td>
  </tr>
  <tr>
    <td class="tg-1lax">3.6</td>
    <td class="tg-2lax">Разрешено сменить напарника, если ваш предыдущий напарник в дальнейшем не будет с вами контактировать каким-либо образом, либо перестал играть.</td>
  </tr>
</tbody>
</table>
		<br><p style="text-align: center;"><i class="fa fa-info-circle"></i><u> БАН – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>
	</blockquote>
</div></div>

<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Игровой чат</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">4.1</td>
    <td class="tg-2lax">Запрещен флуд и спам сообщений, если это мешает другим игрокам.</td>
  </tr>
  <tr>
    <td class="tg-1lax">4.2</td>
    <td class="tg-2lax">Запрещено продавать или делать вид, что вы продаёте читы/макросы.</td>
  </tr>
  <tr>
    <td class="tg-1lax">4.3</td>
    <td class="tg-2lax">Запрещена реклама сторонних проектов и платформ в любой форме.</td>
  </tr>
  <tr>
    <td class="tg-1lax">4.4</td>
    <td class="tg-2lax">Запрещено выдавать себя за администратора или проверяющего проекта. Запрещено использование "ADMIN" или "MODER", или похожие слова в нике.</td>
  </tr>
</tbody>
</table>
		<br><p style="text-align: center;"><i class="fa fa-info-circle"></i><u> БАН/МУТ – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Взаимодействие с Администрацией и Модерацией</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">5.1</td>
    <td class="tg-2lax">Запрещено обращаться в репорт:<br>
		- По вопросам, не связанным с игрой или проблемами на сервере (оффтопить).<br>
		- Оскорблять и дискредитировать работу модерации и проекта в целом.<br>
		- Спамить или капсить.
	</td>
  </tr>
  <tr>
    <td class="tg-1lax">5.2</td>
    <td class="tg-2lax">Запрещено хамское отношение, попытка дискредитации, клевета или обман администрации сервера, а также оскорбление проекта, а так же дезинформация в личных целях.</td>
  </tr>
  <tr>
    <td class="tg-1lax">5.3</td>
    <td class="tg-2lax">Запрещено оскорбление Администрации/Модерации/Проекта в любых формах.</td>
  </tr>
  <tr>
    <td class="tg-1lax">5.4</td>
    <td class="tg-2lax">Игрокам запрещено какими-либо действиями создавать помеху работе администрации.</td>
  </tr>
</tbody>
</table>
		<br><p style="text-align: center;"><i class="fa fa-info-circle"></i><u> БАН/МУТ – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Дополнительная информация</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">6.1</td>
    <td class="tg-2lax">На проекте есть только администрация и проверяющие (игроки ответственные за проверку на стороннее ПО).</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.2</td>
    <td class="tg-2lax">Администрации запрещается играть на сервере как простой игрок.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.3</td>
    <td class="tg-2lax">Проверяющие могут играть на серверах как игрок, но они не следят за игрой с превышением лимита.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.4</td>
    <td class="tg-2lax">Запрещено нарушать правила ивентов прописанных в разделе "Правила участия в ивентах" ниже, в /help на серверах либо в отдельных командах плагинов, например /tc.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.5</td>
    <td class="tg-2lax">Администрация не несет ответственности за обмены на сервере, не отвечает за то кому вам доверять.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.6</td>
    <td class="tg-2lax">Запрещено распространять любую личную информацию Администрации/Модерации/Проверяющих, непубличную информацию и уязвимости проекта.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.7</td>
    <td class="tg-2lax">Жалобы на превышение лимита в приоритете на рассмотрение - при наличии видеозаписи либо скринов. Если вы заметили игроков превышающих лимит в команде, или нарушающих иные правила, пожалуйста, сделайте скрин/видеозапись либо запомните ники игроков и предоставьте нам через <a href="https://vk.me/grandrust_server" target="blank">группу ВК.</a></td>
  </tr>
  <tr>
    <td class="tg-1lax">6.8</td>
    <td class="tg-2lax">Администрация и проверяющие имеют право забанить весь состав друзей/сокланов за игру с читером, за игру с макросами при повторном аккаунте макросника к этим же друзьям, а так же за игру с использованием услуг читеров.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.9</td>
    <td class="tg-2lax">Администрация и проверяющие имеют право забанить вас при наличии веских доказательств при проверке на другом проекте.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.10</td>
    <td class="tg-2lax">Вы можете быть забанены автоматической системой обнаружения подозрительных действий игрока, если вы не совершали противоправных действий, пожалуйста, напишите нам в <a href="https://vk.com/grmoder" target="blank">группу ВК</a> если вы были забанены по ошибке.</td>
  </tr>
  <tr>
    <td class="tg-1lax">6.11</td>
    <td class="tg-2lax">Запрещена попытка продажи, а так же продажа игровых предметов за реальные деньги.</td>
     </tr>
  <tr>
    <td class="tg-1lax">6.12</td>
    <td class="tg-2lax">Сервер может быть остановлен, перезагружен или удален в любое время.</td>
  </tr>
</tbody>
</table>
		<p style="text-align: center;"><i class="fa fa-info-circle"></i><u> БАН/МУТ – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Правила магазина проекта</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">7.1</td>
    <td class="tg-2lax">Активированный товар или привилегию невозможно вернуть, заморозить либо перенести на другой сервер. Если вы забрали товар из корзины на сервере, вернуть его обратно невозможно.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.2</td>
    <td class="tg-2lax">В случае ошибочного пополнения баланса возврат средств невозможен.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.3</td>
    <td class="tg-2lax">Если вас заблокировали на проекте возврат средств невозможен, как и перевод другому игроку.  Вы в ответе за свой аккаунт, товары и баланс на нем.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.4</td>
    <td class="tg-2lax">В случае возврата товара в корзине магазина, стоимость товара возврашается бонусами.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.5</td>
    <td class="tg-2lax">Денежный эквивалент в виде бонусов невозможно переводить на другие аккаунты.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.6</td>
    <td class="tg-2lax">Вещи, купленные на проекте, не подлежат переносу на другие аккаунты.</td>
  </tr>
  <tr>
    <td class="tg-1lax">7.7</td>
    <td class="tg-2lax">Вещи, услуги или баланс не подлежат возврату, продаже или обмену, в том числе на денежные средства или скины, выплата денежного эквивалента промокода не производится.</td>
  </tr>
</tbody>
</table>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Правила участия в ивентах</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
	<td class="tg-1lax">8.1</td>
    <td class="tg-2lax"><b>Нашивки</b><br><br>
		- Запрещено накручивать очки нашивок на друзьях.<br>
		- Запрещено набивать на одном и том же игроке очки свыше 3 раз.<br>
		- Запрещено абузить нашивки, например нашивки за «Уникальный шкаф».<br>
		- Игрок может получить денежный приз за ивент «Нашивки» только один раз.<br>
		- Игроки могут получить денежный приз за ивент на одном конкретном сервере только один раз за глобал вайп нашивок. (Актуальные победители всегда перечислены в нашей группе Вк в постах и в специальном <a href="https://vk.com/@grandrust_server" target="blank">разделе статей</a>)<br>
		- Если вы намереваетесь выиграть денежный приз за ивент, пожалуйста, внимательно ознакомьтесь с настоящими правилами, это очень важно.<br>
		- Игрок может получить денежный приз (или его эквивалент) за ивент только после проверки всех требований которые победитель выполнит в соответствии с настоящими правилами, а так же пройдёт проверку на читы/макросы.<br>
		- Запрещено что-либо чистить в компьютере, переустанавливать операционную систему и/или менять оборудование на протяжении всего вайпа, за который проходит ивент.<br>
		- Запрещено покупать/продавать информацию по местонахождению уникального шкафа у сторонних игроков, владельца или друзей владельца.<br>
	</td>
  </tr>
</tbody>
</table>
<table class="tg">
<tbody>
  <tr>
	<td class="tg-1lax">8.2</td>
    <td class="tg-2lax"><b>Уникальный шкаф</b><br><br>
		- Запрещено покупать, отдавать и т д. шкаф. Очки за шкаф зачтутся только в ходе честной игры.<br>
		- Запрещено покупать/продавать информацию по местонахождению уникального шкафа у сторонних игроков, владельца или друзей владельца.<br>
		- Игрок, заабузивший нашивку, теряет возможность принять повторное участие на срок от 60 дней, а так же не получает нашивку.<br>
		- Игрок, продавший или отдавший шкаф, теряет возможность принять повторное участие на срок от 60 дней.<br>
		- Запрещено ставить шкаф в чужом доме для последующего уничтожения.<br>
		- Запрещено уничтожать шкаф друга или заранее договорившись с игроком.<br>
		- Запрещено повышать очки чужого шкафа.<br>
		- Игрок, у которого уничтожили шкаф, теряет 50 очков. Игрок всё равно может выиграть, если наберёт баллов более 0.<br>
		- Рейтинг победителей не смещается в случае выбывания игрока.<br>
	</td>
  </tr>
</tbody>
</table>
<table class="tg">
<tbody>
  <tr>
	<td class="tg-1lax">8.3</td>
    <td class="tg-2lax"><b>Skin Win</b><br><br>
		- Запрещено накручивать очки заданий на друзьях.<br>
		- Запрещено набивать на одном и том же игроке очки свыше 3 раз.<br>
		- Игрок, заабузивший задание, теряет возможность принять повторное участие на срок от 60 дней, а так же теряет прогресс в заданиях.<br>
		- При обнаружении серьёзных нарушений в правилах ивента Skin Win, игрок так же теряет баланс ивента на покупку скинов.<br>
		- Вы можете получить вознаграждение в ивенте Skin Win при подаче жалобы на игрока, нарушившего правила ивента Skin Win.<br>
	</td>
  </tr>
</tbody>
</table>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Проверка Подозреваемых</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">9.1</td>
    <td class="tg-2lax">Команду проекта не интересует ваша личная информация на проверках. Проверки не записываются для личных целей. Нас не интересуют ваши личные файлы либо пароли. Проверка проходит исключительно для нахождения стороннего ПО, при наличии репортов со стороны игроков.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.2</td>
    <td class="tg-2lax">Проверка на стороннее ПО проводится, только если вы на сервере, не АФК и не имеете Рейд Блок.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.3</td>
    <td class="tg-2lax">Проверки проходят только один на один с проверяющим или с несколькими проверяющими.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.4</td>
    <td class="tg-2lax">Как только вас вызвали на проверку - вам даётся до 5 минут, чтобы связаться с проверяющим, действуя инструкциям на экране, в противном случае вы можете получить блокировку.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.5</td>
    <td class="tg-2lax">Если вы проходите на проверку и закрываете игру, без ведома поверяющего, вы можете получить бан.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.6</td>
    <td class="tg-2lax">Если вы покидаете сервер после вызова, не предоставив контакты для связи и не пройдя проверку, вы получаете бан на всех серверах.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.7</td>
    <td class="tg-2lax">Связь происходит посредством Skype/Discord с демонстрацией вашего экрана. Либо при помощи удаленного доступа, программами - AnyDesk и TeamViewer, если Ваше соединение с интернетом не может показывать хорошее качество связи.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.8</td>
    <td class="tg-2lax">Проверка осуществляется в автоматическом режиме с помощью программы <a href="https://rustcheatcheck.ru/" target="blank">RustCheatCheck</a>. Так же могут понадобиться такие программы, как - Recuva, Everything, Lastactivity и.т.д. Вы так же имеете право отказаться скачивать их, что приравнивается к отказу проверки и последующий бан.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.9</td>
    <td class="tg-2lax">Информация, которая может быть получена при вашей проверке не распространяется, за исключением результатов проверки, которые могут быть затребованы Администрацией других проектов, так же использующих сервис RustCheatCheck для своих проверок.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.10</td>
    <td class="tg-2lax">Так же Администраторы/Модераторы могут затребовать результаты ваших предыдущих проверок других проектов, использующих сервис RustCheatCheck, которые приобщаются к вашему делу (при наличии веских доказательств) и могут повлиять на окончательное решение и дальнейший бан.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.11</td>
    <td class="tg-2lax">Предварительное решение после проверки озвученное проверяющим может отличатся от окончательного, принятого Администрацией.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.12</td>
    <td class="tg-2lax">Если вы не согласны с окончательным решением, принятым не в соответствии настоящих правил, вы можете затребовать у Администрации материалы дела о вашей блокировке направив сообщение в группу по вопросам банов - <a href="https://vk.com/grmoder" target="blank">GRAND RUST | Модерация</a></td>
  </tr>
  <tr>
    <td class="tg-1lax">9.13</td>
    <td class="tg-2lax">Если вы приобрели аккаунт с банами на нашем проекте, разбан либо перепроверка невозможна.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.14</td>
    <td class="tg-2lax">Проверяющий в праве потребовать ваши личные переписки во всех доступных мессенджерах для проверки факта приобретения сторонних ПО. Так же проверяющий имеет право просматривать файлы/картинки/видео/аудио,  если это будет связано с игрой/читами/макросами/банами/покупкой акка. Если во время проверки либо до нее, Вы удалиете какой-либо файл, переписки и тд., без ведома проверяющего - это приравнивается к отказу от проверки и последующий бан.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.15</td>
    <td class="tg-2lax">Проверка может длиться до тех пор, пока проверяющий не проверит всё, что считает нужным.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.16</td>
    <td class="tg-2lax">Рекомендуется записывать откат в ходе спорного рейда (в нычку, в шкаф либо в лут) Главный модератор в праве попросить вас показать откат самого рейда. В ваших интересах доказать, что вы играли без просветов и сторонних ПО.</td>
  </tr>
  <tr>
    <td class="tg-1lax">9.17</td>
    <td class="tg-2lax">Запрос откатов возможен лишь в крайних случаях.</td>
  </tr>
</tbody>
</table>
	</blockquote>
</div></div>
<br>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><div class="spoil-image"></div><span class="spoil-head">Условия разбана</span><br>
	<blockquote class="spoil-Untext">
<table class="tg">
<tbody>
  <tr>
    <td class="tg-1lax">10.1</td>
    <td class="tg-2lax">Администрация не даёт второй шанс. Если бан обоснован, имеет доказательства и основания для бана - разбан невозможен.</td>
  </tr>
  <tr>
    <td class="tg-1lax">10.2</td>
    <td class="tg-2lax">Игрок в праве обжаловать свой бан (игра+ либо  багоюз), если у него имеется откат (видеозапись события) на момент нарушения.</td>
  </tr>
  <tr>
    <td class="tg-1lax">10.3</td>
    <td class="tg-2lax">Игрок в праве обжаловать свой бан на просвет, если у него имеется откат (видеозапись события) на момент нарушения. (Бан без проверки аккаунта возможен в случае многократных рейдов в нычки/лутовые игроков).</td>
  </tr>
  <tr>
    <td class="tg-1lax">10.4</td>
    <td class="tg-2lax">Игрок может избежать бан за мультиаккаунт, если при проверке нового аккаунта - он будет чистый и операционная система будет не новой. В данном случае игрок может играть с нового аккаунта, без последующего бана на нем, но при условии, что бан был выдан более 3 лет назад на основной аккаунт (до 2020 года).</td>
  </tr>
  <tr>
    <td class="tg-1lax">10.5</td>
    <td class="tg-2lax">Если вас забанили по результатам проверки с другого проекта то дальнейшая игра на нашем проекте невозможна, пока не будет получен разбан на изначальном проекте(ах), при условии, что:<br>
	- Пройдена перепроверка на вышеперечисленном(ых) проекте(ах).<br>
	- Ваш аккаунт имеет бан до 2020 года.<br>
	- Нет других аккаунтов с банами.<br>
	- Аккаунт имеет от 500 наигранных часов.<br>
	- Нет мультиаккаунтов.</td>
  </tr>
  <tr>  
    <td class="tg-1lax">10.6</td>
    <td class="tg-2lax">Если вы имеете бан по причине "Выход при проверке", вы можете оставить заявку на разбан в течение недели с момента вайпа, по истечению 7 дней - перепроверка невозможна.</td>
  </tr>
  <tr>  
    <td class="tg-1lax">10.7</td>
    <td class="tg-2lax">Если вы заходите с другого аккаунта, при наличии бана по причине "Выход при проверке" на основном аккаунте, и ваш бан имеет срок действия с  2022 года, то ваш аккаунт получит бан за мультиаккаунт.</td>
</tr>
</tbody>
</table>
	</blockquote>
</div></div>

</div></div>`
};
curcontent["help"] = {
	xhead: 'Команды сервера и бинды',
	xcon: `<div style="padding: 0px 10px;">
Разработчики убрали возможность биндить команды, где присутствует пробел.<br>
Этот бинд стал не рабочим bind клавиша chat.say /home 1.
Мы кое-что изменили, теперь вы можете биндить хом следующим образом.<br>
Наример: ставите местоположение дома "/sethome 1", далее пишите в консоль такую команду bind клавиша "home 1" и бинд работает!<br><br>
<h4>Также доступны следующие быстрые бинды</h4>
<div class="commandblock">

<span class="MsoCommand">bind h home название</span> Запрос телепорта на местоположение дома.<br>
<span class="MsoCommand">bind t tpr имя или steam часто запрашиваемого товарища</span> Отправить телепорт на товарища.<br>
<span class="MsoCommand">bind p remove</span> Включение/Выключение ремувера ваших построек.<br>
<span class="MsoCommand">bind m map.open</span> Открыть/Закрыть карту.<br>
<span class="MsoCommand">bind u building.upgrade</span> Автоматическое улучшение строений.<br>
<span class="MsoCommand">bind k kits.open</span> Открыть меню китов.<br>
<span class="MsoCommand">bind i skin</span> Открыть меню скинов.<br>
<span class="MsoCommand">bind o store.opencart</span> Открыть корзину магазина.<br>
<span class="MsoCommand">bind o store.giveitemall</span> Быстро забрать всё из корзины магазина.<br>
<span class="MsoCommand">bind l skills</span> Открыть меню прокачек.<br>
<span class="MsoCommand">bind l xp</span> Открыть меню внутриигровой валюты.</div><br>
<!--<i class="fa fa-info-circle"></i>--> Также если в этом списке нет ваших любимых команд, вы всё ещё можете забиндить их традиционно. (Кавычки обьязательны, 1 в конце обьязателен)<br>
<div class="commandblock">
<span class="MsoCommand">bind f7 chat.say "/skin"1</span> Скины.<br>
<span class="MsoCommand">bind mouse4 chat.say "/back"1</span> Скрафтить Доп. Рюкзак.</div>
<h4>Бинды для отдельных привилегий</h4>
<div class="commandblock">
<span class="MsoCommand">bind b back</span> Скрафтить Доп. Рюкзак.<br>
<span class="MsoCommand">bind c rec</span> Открыть окно переработчика.</div>
<!--<i class="fa fa-info-circle"></i>--> На каждую команду можно назначить именно свою, удобную для Вас кнопку.<br>
<br>
<h4>ЧАТ команды телепорта</h4>
<div class="commandblock">
<span class="MsoCommand">/tpr ник</span> Отправить запрос на телепортацию к игроку.<br>
<span class="MsoCommand">/tpa</span> Принять запрос на телепортацию.<br>
<span class="MsoCommand">/tpc</span> Отменить/отклонить телепортацию.<br>
<span class="MsoCommand">/sethome название дома</span> Сохранить местоположение дома.<br>
<span class="MsoCommand">/removehome название дома</span> удалить дом с указанным названием.<br>
<span class="MsoCommand">/home list</span> Показать список Ваших домов.<br>
<span class="MsoCommand">/home название дома</span> Телепортироваться на дом с указанным названием.</div><br>
<h4>Команды системы друзей и кланов</h4>
<div class="commandblock">
<span class="MsoCommand">/friend add ник</span> Отправить игроку запрос на дружбу.<br>
<span class="MsoCommand">/friend accept</span> Принять запрос дружбы.<br>
<span class="MsoCommand">/friend deny</span> Отклонить запрос дружбы.<br>
<span class="MsoCommand">/friend remove ник</span> Удалить друга.<br>
<span class="MsoCommand">/friend list</span> Показать список друзей.<br>
<span class="MsoCommand">/ff</span> Переключение урона по друзьям и соклановцам.<br>
<span class="MsoCommand">/ff on/off</span> Включить/Выключить урон по друзьям и соклановцам.</div>
<br>
<h4>Команды китов</h4>
<div class="commandblock">
<span class="MsoCommand">/kit</span> Показать меню наборов.<br>
<span class="MsoCommand">/kit название</span> Получить набор с указанным названием.(полезно для бинда)<br></div>
<h4>Список команд по привилегиям</h4>
<div class="commandblock">
<span class="MsoCommand">/skin</span> Открыть окно выбора скинов.<br>
<span class="MsoCommand">/sil http://ссылка на картинку.png</span> Поставить картинку из интернета на табличку.<br><a href="https://i.imgur.com/1xu85O7.png" target="blank">(как получить ссылку на картинку)</a><br>
<span class="MsoCommand">/chat</span> Все доступные команды по чату.<br>
<span class="MsoCommand">/chat color</span> Сменить цвет ника.<br>
<span class="MsoCommand">/chat prefix</span> Смена префикса перед ником.<br>
<span class="MsoCommand">/rec</span> Открыть окно переработчика.<br>
<span class="MsoCommand">/b</span> Окно рюкзака.</div>
<br>
<h4>Полезные команды</h4>
<div class="commandblock">
<span class="MsoCommand">/block</span> Список заблокированных предметов после вайпа.<br>
<span class="MsoCommand">/pinfo</span> Узнать оставшееся время ваших платных услуг.<br>
<span class="MsoCommand">/vk</span> Привязать ваш VK для уведомлений о рейде или вайпе.<br>
<span class="MsoCommand">/map</span> Открыть/Закрыть карту. (лучше забиндить по примеру выше)<br>
<span class="MsoCommand">/case</span> Открыть ваш склад внутриигровых накоплений.<br>
<span class="MsoCommand">/skill</span> Открыть окно прокачек.<br>
<span class="MsoCommand">/t ник</span> Отправить запрос на трейд.<br>
<span class="MsoCommand">/t yes</span> Принять трейд.<br>
<span class="MsoCommand">/dm</span> Включение/Выключение килл бара.<br>
<span class="MsoCommand">/hit</span> Включение/Выключение хит маркера.<br>
<span class="MsoCommand">/top</span> ТОП 10 игроков сервера.<br>
<span class="MsoCommand">/tc</span> ТОП по ивентам шкафов.<br>
<span class="MsoCommand">/who</span> узнать есть ли в доме уникальный шкаф (смотря на дом).<br>
<span class="MsoCommand">/taxi</span> система автоматизированного такси.<br>
<span class="MsoCommand">/help</span> узнать всю информацию о сервере в том числе о биндах.</div>
</div>`
};

				
curcontent["kit-prem"] = {
	xhead: 'Что входит в киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary" onclick="Open('kit-free', false);">Общие</button>
	<button class="btn btn-secondary active">Prem</button>
	<button class="btn btn-secondary" onclick="Open('kit-wars', false);">Wars</button>
	<button class="btn btn-secondary" onclick="Open('kit-elite', false);">Elite</button>
	<button class="btn btn-secondary" onclick="Open('kit-king', false);">King</button>
	<button class="btn btn-secondary" onclick="Open('kit-grand', false);">Grand</button></div>
	<div class="xbox_custom_kits" ><div class="serverheader">PREM оружие (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hat.wolf.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/mask.bandana.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/burlap.gloves.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ammo.pistol.png">
<div class="kit-item__quantity">x100</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pistol.python.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x5</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bandage.png">
<div class="kit-item__quantity">x10</div></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">PREM ресурсы (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stones.png">
<div class="kit-item__quantity">x5000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wood.png">
<div class="kit-item__quantity">x4000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x1500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cloth.png">
<div class="kit-item__quantity">x500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/leather.png">
<div class="kit-item__quantity">x500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x100</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/scrap.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gears.png">
<div class="kit-item__quantity">x8</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/techparts.png">
<div class="kit-item__quantity">x5</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sewingkit.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalblade.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalpipe.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sheetmetal.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smgbody.png">
<div class="kit-item__quantity">x3</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/riflebody.png">
<div class="kit-item__quantity">x3</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/semibody.png">
<div class="kit-item__quantity">x3</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsigns.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rope.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tarp.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalspring.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/supply.signal.png"></div></div>
</div></div></div>`
};



curcontent["kit-wars"] = {
	xhead: 'Что входит в киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary" onclick="Open('kit-free', false);">Общие</button>
	<button class="btn btn-secondary" onclick="Open('kit-prem', false);">Prem</button>
	<button class="btn btn-secondary active">Wars</button>
	<button class="btn btn-secondary" onclick="Open('kit-elite', false);">Elite</button>
	<button class="btn btn-secondary" onclick="Open('kit-king', false);">King</button>
	<button class="btn btn-secondary" onclick="Open('kit-grand', false);">Grand</button></div>
	<div class="xbox_custom_kits" ><div class="serverheader">WARS оружие (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hat.wolf.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/mask.bandana.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/burlap.gloves.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/attire.hide.poncho.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ammo.pistol.png">
<div class="kit-item__quantity">x150</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smg.thompson.png">
<div class="kit-item__quantity">снаряжён</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bandage.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">WARS ресурсы (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stones.png">
<div class="kit-item__quantity">x10000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wood.png">
<div class="kit-item__quantity">x10000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x3000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x1500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cloth.png">
<div class="kit-item__quantity">x1000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/leather.png">
<div class="kit-item__quantity">x1000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x250</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/scrap.png">
<div class="kit-item__quantity">x80</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gears.png">
<div class="kit-item__quantity">x15</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/techparts.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sewingkit.png">
<div class="kit-item__quantity">x30</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalblade.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalpipe.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalspring.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sheetmetal.png">
<div class="kit-item__quantity">x15</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smgbody.png">
<div class="kit-item__quantity">x4</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/riflebody.png">
<div class="kit-item__quantity">x4</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/semibody.png">
<div class="kit-item__quantity">x4</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsigns.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rope.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tarp.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/supply.signal.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">WARS инструменты (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/woodtea.png">
<div class="kit-item__quantity">дерево</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/oretea.png">
<div class="kit-item__quantity">руда</div></div></div>
</div></div></div>`
};

curcontent["kit-elite"] = {
	xhead: 'Что входит в киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary" onclick="Open('kit-free', false);">Общие</button>
	<button class="btn btn-secondary" onclick="Open('kit-prem', false);">Prem</button>
	<button class="btn btn-secondary" onclick="Open('kit-wars', false);">Wars</button>
	<button class="btn btn-secondary active">Elite</button>
	<button class="btn btn-secondary" onclick="Open('kit-king', false);">King</button>
	<button class="btn btn-secondary" onclick="Open('kit-grand', false);">Grand</button></div>
	<div class="xbox_custom_kits" ><div class="serverheader">ELITE оружие (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/coffeecan.helmet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.jacket.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.kilt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/burlap.gloves.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ammo.pistol.png">
<div class="kit-item__quantity">x200</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smg.mp5.png">
<div class="kit-item__quantity">снаряжён</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bandage.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">ELITE ресурсы (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stones.png">
<div class="kit-item__quantity">x13000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wood.png">
<div class="kit-item__quantity">x12000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x3500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x2000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cloth.png">
<div class="kit-item__quantity">x1500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/leather.png">
<div class="kit-item__quantity">x1500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x300</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/scrap.png">
<div class="kit-item__quantity">x100</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gears.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/techparts.png">
<div class="kit-item__quantity">x15</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sewingkit.png">
<div class="kit-item__quantity">x40</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalblade.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalpipe.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalspring.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sheetmetal.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smgbody.png">
<div class="kit-item__quantity">x6</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/riflebody.png">
<div class="kit-item__quantity">x6</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/semibody.png">
<div class="kit-item__quantity">x6</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsigns.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rope.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tarp.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/supply.signal.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">ELITE инструменты (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/axe.salvaged.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/icepick.salvaged.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/woodtea.advanced.png">
<div class="kit-item__quantity">дерево прод.</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/oretea.advanced.png">
<div class="kit-item__quantity">руда прод.</div></div></div>
</div></div></div>`
};


curcontent["kit-king"] = {
	xhead: 'Что входит в киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary" onclick="Open('kit-free', false);">Общие</button>
	<button class="btn btn-secondary" onclick="Open('kit-prem', false);">Prem</button>
	<button class="btn btn-secondary" onclick="Open('kit-wars', false);">Wars</button>
	<button class="btn btn-secondary" onclick="Open('kit-elite', false);">Elite</button>
	<button class="btn btn-secondary active">King</button>
	<button class="btn btn-secondary" onclick="Open('kit-grand', false);">Grand</button></div>
	<div class="xbox_custom_kits" ><div class="serverheader">KING оружие (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.facemask.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.plate.torso.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.kilt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/burlap.gloves.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ammo.rifle.png">
<div class="kit-item__quantity">x200</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rifle.ak.png">
<div class="kit-item__quantity">снаряжён</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x15</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/largemedkit.png">
<div class="kit-item__quantity">x5</div></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">KING ресурсы (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stones.png">
<div class="kit-item__quantity">x15000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wood.png">
<div class="kit-item__quantity">x15000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x4500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x2500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cloth.png">
<div class="kit-item__quantity">x2500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/leather.png">
<div class="kit-item__quantity">x2500</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x400</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/scrap.png">
<div class="kit-item__quantity">x150</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gears.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/techparts.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sewingkit.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalblade.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalpipe.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalspring.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sheetmetal.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smgbody.png">
<div class="kit-item__quantity">x7</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/riflebody.png">
<div class="kit-item__quantity">x7</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/semibody.png">
<div class="kit-item__quantity">x7</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsigns.png">
<div class="kit-item__quantity">x40</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rope.png">
<div class="kit-item__quantity">x40</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tarp.png">
<div class="kit-item__quantity">x40</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/supply.signal.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/targeting.computer.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cctv.camera.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">KING инструменты (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/uberpickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/uberhatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/chainsaw.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/woodtea.pure.png">
<div class="kit-item__quantity">дерево чистый</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/oretea.pure.png">
<div class="kit-item__quantity">руда чистый</div></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">KING Доп. кит (по привилегии, еженедельный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/largemedkit.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/blueberries.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/candycaneclub.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sulfur.png">
<div class="kit-item__quantity">x10000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gunpowder.png">
<div class="kit-item__quantity">x3000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x5000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/research.table.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/workbench1.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/workbench2.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.facemask.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.plate.torso.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.kilt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
</div></div></div>`
};

curcontent["kit-grand"] = {
	xhead: 'Что входит в киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary" onclick="Open('kit-free', false);">Общие</button>
	<button class="btn btn-secondary" onclick="Open('kit-prem', false);">Prem</button>
	<button class="btn btn-secondary" onclick="Open('kit-wars', false);">Wars</button>
	<button class="btn btn-secondary" onclick="Open('kit-elite', false);">Elite</button>
	<button class="btn btn-secondary" onclick="Open('kit-king', false);">King</button>
	<button class="btn btn-secondary active">Grand</button></div>
	<div class="xbox_custom_kits" ><div class="serverheader">GRAND оружие (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.facemask.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.plate.torso.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.kilt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.gloves.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ammo.rifle.png">
<div class="kit-item__quantity">x300</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rifle.ak.png">
<div class="kit-item__quantity">снаряжён</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rifle.lr300.png">
<div class="kit-item__quantity">снаряжён</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x30</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/largemedkit.png">
<div class="kit-item__quantity">x10</div></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">GRAND ресурсы (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stones.png">
<div class="kit-item__quantity">x20000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wood.png">
<div class="kit-item__quantity">x20000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x6000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x450</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x3000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cloth.png">
<div class="kit-item__quantity">x3000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/leather.png">
<div class="kit-item__quantity">x3000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/scrap.png">
<div class="kit-item__quantity">x200</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gears.png">
<div class="kit-item__quantity">x35</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/techparts.png">
<div class="kit-item__quantity">x25</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sewingkit.png">
<div class="kit-item__quantity">x60</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalblade.png">
<div class="kit-item__quantity">x30</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/riflebody.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/semibody.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsigns.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/rope.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalpipe.png">
<div class="kit-item__quantity">x45</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metalspring.png">
<div class="kit-item__quantity">x45</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smgbody.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sheetmetal.png">
<div class="kit-item__quantity">x30</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tarp.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/supply.signal.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/targeting.computer.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/cctv.camera.png">
<div class="kit-item__quantity">x2</div></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">GRAND инструменты (по привилегии, ежедневный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/healingtea.pure.png">
<div class="kit-item__quantity">хил чистый</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/oretea.pure.png">
<div class="kit-item__quantity">руда чистый</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/woodtea.pure.png">
<div class="kit-item__quantity">дерево чистый</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/uberhatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/ubericepick.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/chainsaw.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/jackhammer.png"></div></div>
</div></div></div>
<div class="xbox_custom_kits" ><div class="serverheader">GRAND Доп. кит (по привилегии, еженедельный)</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.facemask.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.plate.torso.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/roadsign.kilt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hoodie.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/shoes.boots.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/largemedkit.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/blueberries.png">
<div class="kit-item__quantity">x20</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/candycaneclub.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hazmatsuit.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sulfur.png">
<div class="kit-item__quantity">x15000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/gunpowder.png">
<div class="kit-item__quantity">x5000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.fragments.png">
<div class="kit-item__quantity">x10000</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/workbench1.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/workbench2.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/workbench3.png"></div></div>
</div></div></div>`
};

curcontent["kit-free"] = {
	xhead: 'Что входит в бесплатные киты',
	xcon: `<div class="store-categories">
	<button class="btn btn-secondary active">Общие</button>
	<button class="btn btn-secondary" onclick="Open('kit-prem', false);">Prem</button>
	<button class="btn btn-secondary" onclick="Open('kit-wars', false);">Wars</button>
	<button class="btn btn-secondary" onclick="Open('kit-elite', false);">Elite</button>
	<button class="btn btn-secondary" onclick="Open('kit-king', false);">King</button>
	<button class="btn btn-secondary" onclick="Open('kit-grand', false);">Grand</button></div>
<div class="xbox_custom_kits" >
<div class="serverheader">Бомж</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/tshirt.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/pants.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/movembermoustache.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hat.cap.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stone.pickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stonehatchet.png"></div></div>
</div></div>
<div class="serverheader">Starter</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/campfire.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/sleepingbag.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/furnace.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bandage.png">
<div class="kit-item__quantity">x5</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stone.pickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/stonehatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/hammer.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/building.planner.png"></div></div>
</div></div>
<div class="serverheader">Med</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bandage.png">
<div class="kit-item__quantity">x10</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/syringe.medical.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/largemedkit.png"></div></div>
</div></div>
<div class="serverheader">Food</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/blueberries.png">
<div class="kit-item__quantity">x2</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/wolfmeat.cooked.png">
<div class="kit-item__quantity">x5</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smallwaterbottle.png">
<div class="kit-item__quantity">120ml</div></div></div>
</div></div>
<div class="serverheader">Hunter</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/arrow.wooden.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/bow.hunting.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/spear.wooden.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/spear.stone.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/knife.bone.png"></div></div>
</div></div>
<div class="serverheader">За приставку в нике #grandrust</div>
<div class="kit_set"><div class="kit-items">
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/attire.ninja.suit.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/metal.refined.png">
<div class="kit-item__quantity">x50</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lowgradefuel.png">
<div class="kit-item__quantity">x200</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lumberjack.pickaxe.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/lumberjack.hatchet.png"></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/smallwaterbottle.png">
<div class="kit-item__quantity">120ml</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/oretea.pure.png">
<div class="kit-item__quantity">руда чистый</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/jar.pickle.png">
<div class="kit-item__quantity">x5</div></div></div>
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/can.tuna.png">
<div class="kit-item__quantity">x2</div></div></div>
</div></div></div>`
};

curcontent["plugins"] = {
	xhead: 'Уникальные плагины и ивенты',
	xcon: `<div class="xbox_custom_plugins xbox_custom_rules">
<!--<a class="xbox_custom_photo"><img src="https://pp.userapi.com/c637530/v637530980/5d5b4/0uh_67rtFgo.jpg"></a>-->
<blockquote class="pluginsheader"><center>Радиоактивный дом.</center></blockquote>
<p>Дом появляется ежедневно, с промежутком каждые 2 часа, координаты дома указаны в чате и на карте. 
Суть проста – авторизоваться в шкафу, удержать свою авторизацию в течение 10 минут. 
После чего вам будет доступен ящик с ресурсами. Ресурсы выпадают рандомно, в зависимости от времени проведения вайпа, ценность ресурсов будет только увеличиваться. 
Ах да, забыли сообщить. Там будет радиация, много радиации.</p>
<br>
<blockquote class="pluginsheader"><center>Нашивки (Ежемесячный ивент).</center></blockquote>
<p>Открывайте нашивки выполняя задания. За каждую разблокированную нашивку, вы будете получать рандомные призы. 
Всего нашивок 15, если вам удастся разблокировать 15 нашивок раньше всех, вы получите 10.000 рублей на карту или qiwi кошелёк.</p>
<br>
<blockquote class="pluginsheader"><center>Суперигра (Еженедельный ивент)</center></blockquote>
<p>Если у тебя нет денег но хочется поиграть с привилегией, ты всегда можешь принять участие в СУПЕРИГРЕ и выиграть. За добычу дерева, камня, серную и железную руду, 
тебе будет выпадать случайное число от 1 до 2. Задача набрать определённое количество баллов на каждом из ресурсов. Всего ресурсов 4. За каждые набранные ресурсы, 
ты получаешь внутриигровую валюту и можешь потратить её в магазине /shop. Если наберёшь баллы сразу на всех 4-х ресурсах, получишь случайную привилегию Premium, Wars, Elite, King или Grand на 7 дней. Удачи!</p>
<br>
<blockquote class="pluginsheader"><center>Уникальный шкаф (Еженедельный ивент).</center></blockquote>
<p>Ивент, в котором могут принять участие все игроки, проведя на сервере не менее 5 часов. 
Игрок получает уникальный шкаф, который бережёт от уничтожения, в то же время сам старается найти 
и уничтожить как можно больше вражеских шкафов чтобы получить за них очки в топе, тем самым игроки, попавшие в топ 3, и заработавшие больше 0 баллов, получают бонус в виде баланса на магазин.</p>
<br>
<blockquote class="pluginsheader"><center>Система XP, Игровая валюта, Способности и Кейсы.</center></blockquote>
<p>Играя на серверах, вы будете прокачивать свой уровень выполняя различные действия, как при системе ХР. 
Прокачивая уровень вам будут разблокироваться кейсы, которые вы сможете открывать ежедневно. 
Всё содержимое кейсов попадает на склад и храниться там пока вы это не заберёте. 
С прокачкой уровней, вам начисляются Гранды, которые вы можете потратить на покупку необходимых товаров в магазине или прокачку способностей.</p>
<br>
<blockquote class="pluginsheader"><center>ПРМ.</center></blockquote>
<p>Имеется свой собственный ресурс, переработчик и квесты для нахождения редких деталей ПРМ.</p>
<br>
<blockquote class="pluginsheader"><center>Уникальные металлы.</center></blockquote>
<p>Имеются свои собственные уникальные металлы, для переработки в переработчике и ПРМ. После переработки выпадает сера, металл, МВК и другой ценный лут.</p>
<br>
<blockquote class="pluginsheader"><center>Система XP возможность вывода.</center></blockquote>
<p>Теперь вы можете выводить ваши накопления XP в электронном кошельке ввиде монеток в инвентарь. <br>
Вывод доступен через меню внутриигровой валюты и левела в верхнем правом углу экрана. Чтобы внести монеты обратно на счёт нужно набрать от 10 шт. и нажать Upgrade на предмете. <br>
<i class="fa fa-info-circle"></i> Более подробного вы можете ознакомится в самом меню внутриигровой валюты и левела. <br><br>
Что это даёт: <br>
- Теперь вы сможете поделится с другом вашими XP, например, если вы уже прокачали способности, а вашему другу не много не хватило. <br>
- Теперь можно трейдить XP как ресурс на интересующие вас предметы. <br>
- Вы можете зарабатывать XP добывая его даже во время отсутствия на сервере с помощью прибора под названием Майнинговая ферма. </p><br>
<br>
<blockquote class="pluginsheader"><center>Майнинговая ферма.</center></blockquote>
<p>Для сборки Фермы необходимо: устройство для выработки энергии (Малый генератор, Cолнечная панель или Ветрогенератор) 
Разветвитель, Мигалка, Аккумулятор, Радиопередатчик.</p>
<div class="x-spoiler" style="width: 695px;margin-left: 43px;">
<input class="spoil-button" type="checkbox" tabindex="-1">
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Пример подключения смотреть на картинке...</span><br>
	 <blockquote class="spoil-Untext"><a class="xbox_custom_photo"><img src="https://i.imgur.com/Foh383U.png"></a></blockquote>
     </div></div><br>
<p>После того как всё было собрано и подключено, задайте на Радиопередатчике частоту 1001 и нажмите Применить. <br>
Если электро цепь была собрана правильно, сразу после подачи питания на Аккумулятор,<br>
возле него появится Почтовый ящик, в который и будут майниться ваши Гранды.<br>
Как только заряд в Аккумуляторе накопит энергии на 6 минут,<br>
в Почтовом ящике появится 1 Гранд в обмен на энергию в Аккумуляторе, и так по кругу. <br>
6 минут заряда аккумулятора = 1 Гранду.<br>
<i class="fa fa-info-circle"></i> Более подобно можно ознакомится в самом меню внутриигровой валюты и левела во вкладке XP</p><br>
<br>
</div>`
};

var aboutserversdub = `<li>Мощные анти-читы [AntiCheat]</li>
<li>Отзывчивая Администрация</li>
<li>Бесплатные оповещения о рейдах (/vk)</li>
<li>Частые Ивенты [EVENTS]</li>
<li>Ремув своих строений (8 часов с момента строения)[/remove]</li>
<li>Блокировка оружия и взрывчатки после вайпа[/block]</li>
<li>Цензура в чате [Censor]</li>
<li>Внутриигровая карта (bind m map.open)</li>
<li>Онлайн карта [RustIO:/map]</li>
<li>Наборы для новичков [Kits:Starter,Бомж,Med,Food,Hunt]</li>
<li>Мгновенный крафт [InstaCraft]</li>
<li>Блок в зоне рейда [NoEscape]</li>
<li>Авто-апгрейд при постройке в зоне авторизации [Up]</li>
<li>Картинки на таблички [/sil]</li>
<li>Донат-наборы [STORE:Premium, WARS, ELITE, KING, GRAND]</li>
<li>Вертолет каждые 4 часа</li>
<li>Танк каждые 4 часа</li>
<li>Корабль каждые 4 часа</li>
<li>Чинук каждые 4 часа</li>
<li>Автоматические ивенты</li>
<li>Переработчик Редких Металлов (ПРМ)</li>
<li>Способности на сервере прокачиваемые за опыт</li>
<li>Супер игра в которой могут принять участие все желающие</li>
<li>Внутриигровой магазин с покупкой вещей за опыт</li>
<li>Майнинговая ферма грандов (внутриигровой валюты)</li>
<li>Кейсы с внутриигровым складом</li>
<li>День длится 55 минут, Ночь 3 минуты</li>
<li>Запрещено строить дома в текстурах и монументах</li>`;

curcontent["serv"] = {
	xhead: 'О серверах',
	xcon: `<div class="xbox aboutus" style="padding: 0px 20px;">
	<h4>Основная информация</h4>
	<div class="xbox aboutus_main">Модифицированные сервера для комфортной игры в Rust Experimental. Самое новое железо сервера и мощный хостинг с DDOS защитой помогут вам провести время у нас с удовольствием.<br><br>
Тщательно настроенные модификации сервера, отличные плагины, правильная сборка сервера и уникальные захватывающие ивенты помогут вам ощутить все прелести Раста на себе и к тому же получить незабываемый опыт игры.<br><br>
Мы попытались разнообразить геймплей для вас и привнести что-то новое в игру.<br>Хватит читать, заходи и попробуй сам:</div>

<h4 class="serverheader">GRAND RUST#1 Procedural Max 1 </h4><p class="ipconnect">connect 1.grand-rust.ru<a href="steam://connect/1.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Разрешено играть только соло</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#2 Procedural Max 2 </h4><p class="ipconnect">connect 2.grand-rust.ru<a href="steam://connect/2.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 1+1 [Friends,FF,HitMarker]</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#3 Custom Map Max 2 </h4><p class="ipconnect">connect 3.grand-rust.ru<a href="steam://connect/3.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 1+1 [Friends,FF,HitMarker]</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#4 Procedural Max 2 </h4><p class="ipconnect">connect 4.grand-rust.ru<a href="steam://connect/4.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 2 [Friends,FF,HitMarker]</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#5 Procedural Max 3 </h4><p class="ipconnect">connect 5.grand-rust.ru<a href="steam://connect/5.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#6 Procedural Max 3 </h4><p class="ipconnect">connect 6.grand-rust.ru<a href="steam://connect/6.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>
		<li>Система телепортации [HOME]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#7 Procedural Max 2 </h4><p class="ipconnect">connect 7.grand-rust.ru<a href="steam://connect/7.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>
		<li>Система автоматизированного такси [/taxi]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#8 Procedural Max 5 </h4><p class="ipconnect">connect 8.grand-rust.ru<a href="steam://connect/8.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x2, Стаки</li>
		<li>Рейты печек х3</li>
		<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>
		<li>Система автоматизированного такси [/taxi]</li>
		`+ aboutserversdub +`
		</ul>
	</blockquote>
	</div></div>
<br>
<h4 class="serverheader">GRAND RUST#9 Procedural Semi-Classic </h4><p class="ipconnect">connect 9.grand-rust.ru<a href="steam://connect/9.grand-rust.ru:28015" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>

<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1">
    <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Описание сервера</span><br>
	<blockquote class="spoil-Untext">
		<ul><li><b>Новейшее железо сервера</b></li>
		<li>Рейты x1.5</li>
		<li>Стаки х2 на ресурсы в шкафу</li>
		<li>Рейты печек х2</li>
		<li>Рейт карьеров х1.5</li>
		<li>Скорость крафта х2</li>
		<li>Ускоренные белые ночи (55 день, 5 ночь)</li>
		<li>Блокировка доната первые 24 часа</li>
		<li>Бесплатные уведомления о рейде</li>
		<li>Остальное классика</li>
		<li>Запрещено строить дома в текстурах и монументах</li>
		</ul>
	</blockquote>
	</div></div>
</div>`
};



curcontent["Oplata"] = {
	xhead: 'Пополнение баланса',
	xcon: `<div class="xbox oplata_info"><!-- marker qiwi -->
<form onsubmit="return lavaHandler(event)" class="qiwi-inp-form" id="lava-inp-form" method="get" target="_blank" action="/api/lava.php" style="display: none;">
<label for="lava-donation-amount" class="qiwi-inp-main" id="qiwi-inp-lava">
	<div class="qiwi-widget-title qiwi-title-2">СБП, Карты (P2P)
		<p>Без комиссии</p></div>
	<div class="qiwi-inp-box">
			<label for="lava-donation-amount" class="qiwi-label">Cумма</label>
			<div class="qiwi-rub">₽</div>
			<input type="tel" class="qiwi-donation-amount" id="lava-donation-amount" name="amo" required="" value="">
			<input type="hidden" id="lava-donation-account" name="acc" value="0">
			<div class="qiwi-error-box" id="lava-error-box"></div>
	</div>
	<div class="qiwi-button-box">
		<button class="qiwi-submit-main" id="lava-submit-main" width="159px" type="submit">Оплатить</button>
	</div>
	<div class="payment-block" style="margin: 0 13.5% 7px;">
        <div class="payment-type payment-block-mir"></div><div class="payment-type payment-block-lava"></div>
	</div>
	</label>
</form><!-- marker qiwi end --><!-- marker cards -->
<form onsubmit="return centHandler(event)" class="qiwi-inp-form" id="cent-inp-form" method="get" target="_blank" action="/api/cent.php">
<label for="cent-donation-amount" class="qiwi-inp-main" id="qiwi-inp-cent">
	<div class="qiwi-widget-title qiwi-title-2">СБП, Карты
		<p style="color: red;">Карты временно не работают</p></div>
	<div class="qiwi-inp-box">
			<label for="cent-donation-amount" class="qiwi-label">Cумма</label>
			<div class="qiwi-rub">₽</div>
			<input type="tel" class="qiwi-donation-amount" id="cent-donation-amount" name="amo" required="" value="">
			<input type="hidden" id="cent-donation-account" name="acc" value="0">
			<div class="qiwi-error-box" id="cent-error-box"></div>
	</div>
	<div class="qiwi-button-box">
		<button class="qiwi-submit-main" id="cent-submit-main" width="159px" type="submit">Оплатить</button>
	</div>
	<div class="payment-block">
        <div class="payment-type payment-block-visa"></div><div class="payment-type payment-block-mastercard"></div><div class="payment-type payment-block-mir"></div>
	</div>
	</label>
</form><!-- marker cards end --><!-- marker fk -->
<form onsubmit="return freekassaHandler(event)" class="qiwi-inp-form" id="fk-inp-form" method="get" target="_blank" action="https://pay.freekassa.ru/">
<label for="fk-donation-amount" class="qiwi-inp-main qiwi-inp-other" id="qiwi-inp-other">
	<div class="qiwi-widget-title qiwi-title-3">Криптовалюта,<br>YooMoney, WMZ и др.</div>
	<div class="qiwi-inp-box">
			<label for="fk-donation-amount" class="qiwi-label">Cумма</label>
			<div class="qiwi-rub">₽</div>
			<input type="tel" class="qiwi-donation-amount" id="fk-donation-amount" name="oa" required="" value="">
			<input type="hidden" id="fk-donation-comment" name="o" value="Account">
			<input type="hidden" id="fk-donation-sign" name="s" value="">
			<input type="hidden" id="fk-donation-account" name="us_account" value="0">
			<input type="hidden" name="m" value="12859">
			<input type="hidden" name="currency" value="RUB">
			<div class="qiwi-error-box" id="fk-error-box"></div>
	</div>
	<div class="qiwi-button-box">
		<button class="qiwi-submit-main" id="fk-submit-main" width="159px" type="submit">Оплатить</button>
	</div>
	<div class="payment-block">
        <!-- <div class="payment-type payment-block-steam"></div> --><div class="payment-type payment-block-crypto"></div><div class="payment-type payment-block-yoomoney"></div><div class="payment-type payment-block-webmoney"></div><!--<div class="payment-type payment-block-megafon"></div>-->
	</div>
	</label>
</form><!-- marker fk end --><!-- marker sb -->
<div class="qiwi-inp-form skinsback-create-main">
<a class="qiwi-inp-main qiwi-inp-other" href="/api/skinsback/" target="_blank">
	<div class="qiwi-widget-title qiwi-title-3">Оплата скинами<p>Практически по ценам с маркета</p></div>
<div class="qiwi-button-box">
		<button class="qiwi-submit-main" width="159px">Перейти</button>
	</div>
	</a>
</div><!-- marker sb end -->
</div>
<div class="x-spoiler">
<input class="spoil-button" type="checkbox" tabindex="-1" style="height: 14%;">
    <div class="spoil-box">
	<div style="display: flex;-webkit-box-align: center;-ms-flex-align: center;align-items: center;-ms-flex-pack: end;justify-content: space-between;"><div><span class="spoil-open fa"></span><span class="spoil-head">Ни один метод выше не работает?</span></div>
		<div class="spoil-right-logo-box">
			<span class="fa-cc-visa fa"></span>
			<span class="fa-cc-mastercard fa"></span>
			<span class="fa-cc-jcb fa"></span>
			<span class="fa-cc-amex fa"></span>
			<span class="fa-cc-paypal fa"></span>
			<span class="fa-google fa">Pay</span>
		</div>
	</div>
	<blockquote class="spoil-Untext">
		<div class="container">
		  <div class="row">
			<div class="col-md-10 offset-md-1">
			  <h1 class="tebex-header text-center mb-4">Сколько вы хотели перевести?</h1>
			  <form onsubmit="return false">
				<div class="form-group">
				  <div class="input-group"><div class="input-group-addon">RUB</div><input id="rubInput" type="tel" class="form-control form-control-lg" placeholder="Введите сумму желаемого перевода в рублях" autocomplete="off"></div>
				</div>
			  </form>
			  <div id="allbOutput" style="visibility: hidden;">
				<div class="card card-primary mb-2">
				  <div class="card-block">
					<h4>Нужно оплатить: $ <span id="bucksOutput"></span></h4>
				  </div>
				</div>

				<div class="tebex-mainlink mb-2 mt-3"">
					<a href="https://grand-rust.tebex.io/checkout/packages/add/5036554/single?currency=USD" target="_blank" rel="nofollow noopener" title="https://grand-rust.tebex.io/checkout/packages/add/5036554/single" class="card-block">
						<h4>Через <u>Tebex</u></h4>
					</a>
				</div>
				<span style="font-size: x-small;">(Чем крупнее платёж - тем выгоднее комиссия платформы Tebex)</span>
				<div class="tebex-warning mb-2 mt-4" style="background-color: #f0ad4e5e;padding: 5px 10px;border-radius: 5px;color: #ffe4c4;">
					<h4><b>Внимание!</b></h4>
					<div>- Очень важно авторизоваться там с того же аккаунта Steam.<br>- Указать там сумму именно в валюте USD.<br><i class="fa fa-info-circle"></i> После оплаты можно возвращаться на эту станицу и обновить её, сумма в рублях будет автоматически начислена вам на баланс в нашем магазине.</div>
				</div>
			  </div>
			</div>
		  </div>
		</div>
	</blockquote>
	</div>
</div>
<br>
<br>`
};



var BlockListArrays = [['pistol.revolver', 'shotgun.double', 'snowballgun'], 
['pistol.python', 'pistol.semiauto', 'flamethrower', 'coffeecan.helmet', 'roadsign.kilt', 'roadsign.jacket'], 
['shotgun.pump', 'pistol.prototype17'], 
['rifle.semiauto', 'smg.mp5', 'shotgun.spas12', 'pistol.m92', 'smg.thompson', 'smg.2', 'metal.facemask', 'metal.facemask.icemask', 'metal.plate.torso', 'metal.plate.torso.icevest', 'heavy.plate.helmet', 'heavy.plate.jacket', 'heavy.plate.pants', 'shotgun.m4'],
['rifle.ak', 'rifle.ak.ice', 'rifle.ak.diver', 'rifle.bolt', 'rifle.lr300', 'rifle.l96', 'rifle.m39', 'ammo.rocket.mlrs', 'ammo.grenadelauncher.he'], 
['lmg.m249', 'hmlmg', 'grenade.f1', 'grenade.beancan', 'explosive.satchel', 'surveycharge', 'ammo.rifle.explosive'], 
['explosive.timed', 'rocket.launcher', 'homingmissile.launcher']];


curcontent["block"] = {
	xhead: 'Блокировка оружия и взрывчатого после вайпа',
	xcon: '<div class="xbox_custom_block"><div class="kit-items">'
	
};

var visitorCountry = 'RU';



function Open(el, usefade = true, zind = '2') {
	closepage();
	var div1 = document.createElement("div");
    div1.id = 'Modal';
	var div2 = document.createElement("div");
	div2.className = 'modal fade';
	if(!usefade) div2.classList.add("show");
	div2.style = 'display: block;';
	div2.id = 'closer';
	//div2.onclick = closepage;
	var div3 = document.createElement("div");
	div3.className = "modal-dialog modal-lg modal-custom";
	if(el=="block")div3.className+=" modal-lg-block"
	var div4 = document.createElement("div");
	div4.className = "modal-content";
	var div5 = document.createElement("div");
	div5.className = "modal-header";
	div5.innerHTML = '<h4 class="modal-title">'+curcontent[el].xhead+'</h4>';
	var div6 = document.createElement("div");
	div6.className = "modal-body";
	div6.innerHTML = curcontent[el].xcon;
	var div7 = document.createElement("div");
	div7.className = "modal-footer";
	div7.innerHTML = '<center><button class="btn btn-danger" id="closer" onclick="closepage()">Закрыть</button><center>';
	var div8 = document.createElement("div");
	div8.className = "modal-backdrop fade show";
	
	div1.appendChild(div2);
	//div2.appendChild(div2_5);
	div2.appendChild(div3);
	div3.appendChild(div4);
	div4.appendChild(div5);
	div4.appendChild(div6);
	div4.appendChild(div7);
	div1.appendChild(div8);
	if(usefade) setTimeout(()=> div2.classList.add("show"), 0);
	
	var body = document.getElementsByTagName('body')[0];
	body.appendChild(div1);
	body.className = "modal-open";
}


function closepage(){
	var Modal = document.getElementById('Modal');
	var Modalparent = null;
	try{ Modalparent = ((Modal.parentElement) ? Modal.parentElement : ((Modal.parentNode) ? Modal.parentNode : null));}catch (err){return;}
	if(Modalparent == null)return;
	Modalparent.removeChild(Modal);
	document.getElementsByTagName('body')[0].className = "";
}

function search(e){
	if (e.offsetX < 1) { 
		console.log(e.target.innerText + ' | ' + e.clientX);
		if (document.selection) { // IE
			var range = document.body.createTextRange();
			range.moveToElementText(e.target);
			range.select();
		} else if (window.getSelection) {
			var range = document.createRange();
			range.selectNode(e.target);
			window.getSelection().removeAllRanges();
			window.getSelection().addRange(range);
		}
		try {
			var successful = document.execCommand('copy');
			var msg = successful ? 'successful' : 'unsuccessful';
			console.log('успешно скопирован, нажмите CTRL + V чтобы вставить в консоль F1 в игре.'); 
		  } catch (err) {
			console.log('Oops, unable to copy ' + err);
		  }
    }
}


var CustomerSteamId = "0";
var OvhPayUrl = "";

/* function qiwiHandler(e){
	var inputval = document.getElementById('qiwi-donation-amount').value;
	var inputfloat = parseFloat(inputval).toFixed(2);
	if(inputfloat < 5 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('qiwi-error-box').innerText = "От 5 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('qiwi-error-box').innerText = "";
	}
	document.getElementById('qiwi-donation-amount').value = inputfloat;
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('qiwi-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	qiwiFormHandle();
	
	return null;
} */
function freekassaHandler(e){
	qiwiFormHandle();
	var inputval = document.getElementById('fk-donation-amount').value;
	var inputfloat = parseFloat(inputval);
	if(inputfloat < 100 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('fk-error-box').innerText = "От 100 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('fk-error-box').innerText = "";
	}
	document.getElementById('fk-donation-amount').value = inputfloat;
	document.getElementById('fk-donation-sign').value = MD5('12859:'+ inputfloat +':dblwsabt:RUB:'+ document.getElementById('fk-donation-comment').value);
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('fk-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	
	return null;
}
/* function unitpayHandler(e){
	qiwiFormHandle();
	var inputval = document.getElementById('unitpay-donation-amount').value;
	var inputfloat = parseFloat(inputval).toFixed(2);
	if(inputfloat < 1 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('unitpay-error-box').innerText = "От 1 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('unitpay-error-box').innerText = "";
	}
	document.getElementById('unitpay-donation-amount').value = inputfloat;
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('unitpay-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	
	return null;
} */

function centHandler(e){
	qiwiFormHandle();
	var inputval = document.getElementById('cent-donation-amount').value;
	var inputfloat = parseFloat(inputval).toFixed(2);
	if(inputfloat < 15 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('cent-error-box').innerText = "От 15 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('cent-error-box').innerText = "";
	}
	document.getElementById('cent-donation-amount').value = inputfloat;
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('cent-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	
	return null;
}

function lavaHandler(e){
	qiwiFormHandle();
	var inputval = document.getElementById('lava-donation-amount').value;
	var inputfloat = parseFloat(inputval).toFixed(2);
	if(inputfloat < 5 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('lava-error-box').innerText = "От 5 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('lava-error-box').innerText = "";
	}
	document.getElementById('lava-donation-amount').value = inputfloat;
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('lava-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	
	return null;
}

function qiwiFormHandle(){
	var a1 = document.getElementById('lava-donation-account');
	if(a1 != null)
	a1.value = CustomerSteamId;
	var b2 = document.getElementById('cent-donation-account');
	if(b2 != null)
	b2.value = CustomerSteamId;
	var a3 = document.getElementById('fk-donation-comment');
	if(a3 != null)
	a3.value = "Account " + CustomerSteamId;
	var a4 = document.getElementById('fk-donation-account');
	if(a4 != null)
	a4.value = CustomerSteamId;
	// document.getElementById('qiwi-inp-other')?.setAttribute("href", OvhPayUrl);
	var a5 = document.getElementById('qiwi-donation-comment');
	if(a5 != null)
	a5.value = "Автоматическое пополнение через QIWI Grand Rust Аккаунт " + CustomerSteamId;
	var a6 = document.getElementById('qiwi-donation-account');
	if(a6 != null)
	a6.value = CustomerSteamId;
	var a7 = document.getElementById('qiwi-successUrl');
	if(a7 != null)
	a7.value = 'https://'+window.location.hostname;
}

function OvhUrlOverrite(){
	var slides = document.getElementsByClassName("nav-link");
	for (var i = 0; i < slides.length; i++) {
		var elelink = slides.item(i);
		var urlelelink = elelink.getAttribute("href");
		if(urlelelink.startsWith('https://pay.moscow.ovh') || urlelelink.startsWith('/pay')){
		   OvhPayUrl = urlelelink;
		   // console.log(OvhPayUrl);
		   elelink.setAttribute("href", "javascript:;");
		   elelink.setAttribute("onclick", "OpenOplata()");
		   // break;
		}
		if(urlelelink == 'https://vk.com/grandrust_server'){
		   elelink.setAttribute("href", "javascript:;");
		   elelink.setAttribute("onclick", "Open('contacts')");
		   // break;
		}
	}
}

function obtainShopSteamId(){
	if(CustomerSteamId != "0" && CustomerSteamId != ""){
		OvhUrlOverrite();
		return;
	}
	CustomerSteamId = getCookie().toString();
	if(CustomerSteamId != "0" && CustomerSteamId != "" && CustomerSteamId.length == 17){
		OvhUrlOverrite();
		return;
	}
	
	var xmlHttp = new XMLHttpRequest();

        if(xmlHttp != null)
        {
            xmlHttp.open( "POST", "/api/index.php", true );
			xmlHttp.setRequestHeader('Content-type', 'application/x-www-form-urlencoded');
            xmlHttp.send( "modules=users&action=getData" );
        }
		xmlHttp.onload = function(gjson) {
			var gjson = JSON.parse(xmlHttp.response);
			if(gjson === null || gjson === undefined || gjson.data === null || gjson.data === undefined){
				OvhUrlOverrite();
				return;
			}
          // console.log(gjson);
			var preSteam = gjson.data.steamID;
			OvhPayUrl = "https://pay.moscow.ovh/?"+gjson.data.pay;
			if(preSteam > 76561100000000000 || !isNaN(preSteam)){
				CustomerSteamId = preSteam.toString();
				//qiwiFormHandle();
				OvhUrlOverrite();
			}else{
				console.log("error obtainShopSteamId! "+ gjson);
			}
		}

}

function OpenOplata(){
	Open('Oplata');
	setTimeout(() => function () {
		try{
			qiwiFormHandle();
		}catch(e){
			console.log('element not found '+ e);
		}
	}, 3000);
	qiwiFormHandle();
}

var DOMReady = function(a,b,c){b=document,c='addEventListener';b[c]?b[c]('DOMContentLoaded',a):window.attachEvent('onload',a)}
window.addEventListener("load",function () {
	try{
		obtainShopSteamId();
	}catch(e){
		console.log('element not found '+ e);
	}
});

var MD5 = function(d){result = M(V(Y(X(d),8*d.length)));return result.toLowerCase()};function M(d){for(var _,m="0123456789ABCDEF",f="",r=0;r<d.length;r++)_=d.charCodeAt(r),f+=m.charAt(_>>>4&15)+m.charAt(15&_);return f}function X(d){for(var _=Array(d.length>>2),m=0;m<_.length;m++)_[m]=0;for(m=0;m<8*d.length;m+=8)_[m>>5]|=(255&d.charCodeAt(m/8))<<m%32;return _}function V(d){for(var _="",m=0;m<32*d.length;m+=8)_+=String.fromCharCode(d[m>>5]>>>m%32&255);return _}function Y(d,_){d[_>>5]|=128<<_%32,d[14+(_+64>>>9<<4)]=_;for(var m=1732584193,f=-271733879,r=-1732584194,i=271733878,n=0;n<d.length;n+=16){var h=m,t=f,g=r,e=i;f=md5_ii(f=md5_ii(f=md5_ii(f=md5_ii(f=md5_hh(f=md5_hh(f=md5_hh(f=md5_hh(f=md5_gg(f=md5_gg(f=md5_gg(f=md5_gg(f=md5_ff(f=md5_ff(f=md5_ff(f=md5_ff(f,r=md5_ff(r,i=md5_ff(i,m=md5_ff(m,f,r,i,d[n+0],7,-680876936),f,r,d[n+1],12,-389564586),m,f,d[n+2],17,606105819),i,m,d[n+3],22,-1044525330),r=md5_ff(r,i=md5_ff(i,m=md5_ff(m,f,r,i,d[n+4],7,-176418897),f,r,d[n+5],12,1200080426),m,f,d[n+6],17,-1473231341),i,m,d[n+7],22,-45705983),r=md5_ff(r,i=md5_ff(i,m=md5_ff(m,f,r,i,d[n+8],7,1770035416),f,r,d[n+9],12,-1958414417),m,f,d[n+10],17,-42063),i,m,d[n+11],22,-1990404162),r=md5_ff(r,i=md5_ff(i,m=md5_ff(m,f,r,i,d[n+12],7,1804603682),f,r,d[n+13],12,-40341101),m,f,d[n+14],17,-1502002290),i,m,d[n+15],22,1236535329),r=md5_gg(r,i=md5_gg(i,m=md5_gg(m,f,r,i,d[n+1],5,-165796510),f,r,d[n+6],9,-1069501632),m,f,d[n+11],14,643717713),i,m,d[n+0],20,-373897302),r=md5_gg(r,i=md5_gg(i,m=md5_gg(m,f,r,i,d[n+5],5,-701558691),f,r,d[n+10],9,38016083),m,f,d[n+15],14,-660478335),i,m,d[n+4],20,-405537848),r=md5_gg(r,i=md5_gg(i,m=md5_gg(m,f,r,i,d[n+9],5,568446438),f,r,d[n+14],9,-1019803690),m,f,d[n+3],14,-187363961),i,m,d[n+8],20,1163531501),r=md5_gg(r,i=md5_gg(i,m=md5_gg(m,f,r,i,d[n+13],5,-1444681467),f,r,d[n+2],9,-51403784),m,f,d[n+7],14,1735328473),i,m,d[n+12],20,-1926607734),r=md5_hh(r,i=md5_hh(i,m=md5_hh(m,f,r,i,d[n+5],4,-378558),f,r,d[n+8],11,-2022574463),m,f,d[n+11],16,1839030562),i,m,d[n+14],23,-35309556),r=md5_hh(r,i=md5_hh(i,m=md5_hh(m,f,r,i,d[n+1],4,-1530992060),f,r,d[n+4],11,1272893353),m,f,d[n+7],16,-155497632),i,m,d[n+10],23,-1094730640),r=md5_hh(r,i=md5_hh(i,m=md5_hh(m,f,r,i,d[n+13],4,681279174),f,r,d[n+0],11,-358537222),m,f,d[n+3],16,-722521979),i,m,d[n+6],23,76029189),r=md5_hh(r,i=md5_hh(i,m=md5_hh(m,f,r,i,d[n+9],4,-640364487),f,r,d[n+12],11,-421815835),m,f,d[n+15],16,530742520),i,m,d[n+2],23,-995338651),r=md5_ii(r,i=md5_ii(i,m=md5_ii(m,f,r,i,d[n+0],6,-198630844),f,r,d[n+7],10,1126891415),m,f,d[n+14],15,-1416354905),i,m,d[n+5],21,-57434055),r=md5_ii(r,i=md5_ii(i,m=md5_ii(m,f,r,i,d[n+12],6,1700485571),f,r,d[n+3],10,-1894986606),m,f,d[n+10],15,-1051523),i,m,d[n+1],21,-2054922799),r=md5_ii(r,i=md5_ii(i,m=md5_ii(m,f,r,i,d[n+8],6,1873313359),f,r,d[n+15],10,-30611744),m,f,d[n+6],15,-1560198380),i,m,d[n+13],21,1309151649),r=md5_ii(r,i=md5_ii(i,m=md5_ii(m,f,r,i,d[n+4],6,-145523070),f,r,d[n+11],10,-1120210379),m,f,d[n+2],15,718787259),i,m,d[n+9],21,-343485551),m=safe_add(m,h),f=safe_add(f,t),r=safe_add(r,g),i=safe_add(i,e)}return Array(m,f,r,i)}function md5_cmn(d,_,m,f,r,i){return safe_add(bit_rol(safe_add(safe_add(_,d),safe_add(f,i)),r),m)}function md5_ff(d,_,m,f,r,i,n){return md5_cmn(_&m|~_&f,d,_,r,i,n)}function md5_gg(d,_,m,f,r,i,n){return md5_cmn(_&f|m&~f,d,_,r,i,n)}function md5_hh(d,_,m,f,r,i,n){return md5_cmn(_^m^f,d,_,r,i,n)}function md5_ii(d,_,m,f,r,i,n){return md5_cmn(m^(_|~f),d,_,r,i,n)}function safe_add(d,_){var m=(65535&d)+(65535&_);return(d>>16)+(_>>16)+(m>>16)<<16|65535&m}function bit_rol(d,_){return d<<_|d>>>32-_}




DOMReady(function () {
	
	try{
		setTimeout(() => obtainShopSteamId(), 500);
		setTimeout(() => obtainShopSteamId(), 1000);
		setTimeout(() => obtainShopSteamId(), 1500);
		setTimeout(() => obtainShopSteamId(), 4000);
		obtainShopSteamId();
	}catch(e){
		console.log('element not found '+ e);
	}
	
	//setTimeout(() => CheckDisCounter(), 5000);
	
	document.body.onclick=function(event)
	{
		if(event.target.id == 'closer')closepage();
		if(event.target.className == 'MsoCommand')search(event);
	}
	
	for (var i = 0; i < BlockListArrays.length; i++) {
		curcontent["block"].xcon += '<div class="block_by_category block_category_'+ (i + 1) +'">';
		for (var b = 0; b < BlockListArrays[i].length; b++) {
			var curblitem = BlockListArrays[i][b];
			curcontent["block"].xcon += `<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://shop.grand-rust.ru/files/images/rust/items256/`+ curblitem +`.png" srcSet="https://shop.grand-rust.ru/files/images/rust/items256/`+ curblitem +`.webp 1x, https://shop.grand-rust.ru/files/images/rust/items/`+ curblitem +`.webp 1.1x">
										<div class="kit-item__quantity block-lvl-`+ (i + 1) +`"></div></div></div>`;
		}
		curcontent["block"].xcon += '</div>';
	}
	curcontent["block"].xcon += `</div>
	<br><i class="fa fa-info-circle"></i> Внимание! Вся эта таблица так же доступна на сервере по команде /block для более подробного ознакомления с оставшимся временем до разблокировки и с более актуальными предметами!</div>`;
	
	
	
	if(visitorCountry == 'UA'){
		var origstring = curcontent["Oplata"].xcon.toString();
		try{
			curcontent["Oplata"].xcon = origstring.replace(/<!-- marker cards -->.*<!-- marker cards end -->/gs, '').replace('Скины, Криптовалюта, YooMoney и др.', 'Карты, Скины, Криптовалюта и др.').replace(' qiwi-inp-other', '');
			
			var qiwiformstr = curcontent["Oplata"].xcon.match(/<!-- marker qiwi -->.*<!-- marker qiwi end -->/gs)[0].replace('marker', '');
			var fkformstr = curcontent["Oplata"].xcon.match(/<!-- marker fk -->.*<!-- marker fk end -->/gs)[0].replace('marker', '');
			
			curcontent["Oplata"].xcon = curcontent["Oplata"].xcon.replace(/<!-- marker qiwi -->.*<!-- marker qiwi end -->/gs, fkformstr).replace(/<!-- marker fk -->.*<!-- marker fk end -->/gs, qiwiformstr);
		}catch(e){
			console.log(e.toString());
			curcontent["Oplata"].xcon = origstring;
		}
	}
});


function getCookie(name = "_id") {
  let matches = document.cookie.match(new RegExp(
    "(?:^|; )" + name.replace(/([\.$?*|{}\(\)\[\]\\\/\+^])/g, '\\$1') + "=([^;]*)"
  ));
  return matches ? decodeURIComponent(matches[1]) : "";
}


function closewarn(){
	var Modal = document.getElementById('thlztj679ll');
	var Modalparent = null;
	try{ Modalparent = ((Modal.parentElement) ? Modal.parentElement : ((Modal.parentNode) ? Modal.parentNode : null));}catch{return;}
	if(Modalparent == null)return;
  	Modal.classList.remove("s-alert-show"); 
  	Modal.classList.remove("custom-warning-4s");
    Modal.classList.add("s-alert-hide"); 
    Modal.classList.add("custom-warning-1s");
  setTimeout(function() {
     Modalparent.removeChild(Modal);
   }, 250);
}

function snow_off() {
  	document.getElementById('snow_off').style.display = 'none';
    document.getElementById('lightrope').style.display = 'none';
    // document.getElementById('winter-snow-main').style.display = 'none';
    document.getElementById('snowcanvas').style.display = 'none';
	if(s != null)s.destroy();
    document.getElementById('parallax-banner').style.display = 'none';
}

document.addEventListener("input", function (e) {
	if(e.target.id!='rubInput')return;
	var sumbucks = (parseFloat(parseFloat(e.target.value/80)+parseFloat(0.3))*(100/(100-8))).toFixed(2);
	if(sumbucks == '' || isNaN(sumbucks) || sumbucks < 1){
		sumbucks = 1;
	}
  document.getElementById("allbOutput").style.visibility = "visible";
  document.getElementById("bucksOutput").innerHTML = sumbucks;
});



//////test user country
try{
	if (window.performance && performance.getEntriesByType) { // avoid error in Safari 10, IE9- and other old browsers
		let navTiming = performance.getEntriesByType('navigation')
		if (navTiming.length > 0) { // still not supported as of Safari 14...
			let serverTiming = navTiming[0].serverTiming
			if (serverTiming && serverTiming.length > 0) {
				for (let i=0; i<serverTiming.length; i++) {
					console.log(`Detected continent is ${serverTiming[i].name}`);
					visitorCountry = serverTiming[i].name;
				}
			}
		}
	}
}
catch(e){console.log('Error serverTiming: '+e);}
