var curcontent = new Array();
curcontent["faq"] = {
	xhead: 'Ответы на популярные вопросы',
	xcon: '<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как часто на сервере вайп?</span><br><blockquote class="spoil-Untext">🌎 Вайп карты каждый четверг в 11:00 МСК<br>📘 Вайп чертежей (глобальный) 2 раза в месяц (Один раз вместе с глобал обновой разработчиков(в первый четверг месяца (но мы проводим его в пятницу 11:00 МСК)), второй через 2 недели после него, тоже в четверг)<br><i class="fa fa-info-circle"></i><span> Возможны внеплановые вайпы любого сервера, по требованию игроков/народного голосования</span></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box">\
         <span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Не могу зайти на сервер, EAC Disconnected</span>\
         <blockquote class="spoil-Untext">\
EAC не идеален и может ошибочно отключать игроков при подключении на сервер. В этом случае есть несколько вариантов решения проблемы:<br><ol class="numbered" style="padding-bottom: 0px; margin-bottom: 0px; padding-left: 30px;"><li style="padding: 4px 0px 4px 3px;"><span class="l">Попробовать зайти ещё раз.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l">Перезапустить игру.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l">Перезапустить Steam.</span></li><li style="padding: 4px 0px 4px 3px;"><span class="l" style="">Попробовать позже.</span></li></ol>\
         </blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Всё на английском</span><br>\
	 <blockquote class="spoil-Untext">Если у вас все сообщения на английском, в том числе ответы от плагинов в чате, включите стандартный язык клиента на русском и перезайдите (или \'/lang ru\' в чат)</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Другие вопросы</span><br><blockquote class="spoil-Untext">\
<b>Вопрос</b>: Когда бывает обновление от разработчиков и зачем оно?<br>\
<b>Ответ</b>: Обновление игры и сервера практически всегда выходит с четверга на пятницу (ночью). С каждым обновлением разработчики вводят что-то новое, исправляют недочеты, оптимизируют производительность. Следить за обновлениями вы всегда можете на сайте игры: playrust.com<br><br>\
<b>Вопрос</b>: Зачем делать вайп?<br>\
<b>Ответ</b>: Это уменьшает лаги, оптимизирует сервер и порой это необходимо в связи с обновлением от разработчиков.<br><br>\
<b>Вопрос</b>: Что очищается при вайпе?<br>\
<b>Ответ</b>: При обычном вайпе обычно очищаются только постройки и инвентари игроков.<br><br>При глобал вайпе с постройками удаляются ещё и чертежи, данные игроков - такие как различные топы, данные о достижениях игроков в различных системах прокачки и в ивентах. Но могут быть исключения о которых мы пишем зарание в постах в нашей группе!<br>📦 Склад не очищается никогда!<br>Чтобы узнать когда какой вайп см. начало - первый вопрос...<br><br>\
<b>Вопрос</b>: Зачем делать рестарт?<br>\
<b>Ответ</b>: Рестарт каждые 12 часов нужен для того, чтобы устранить утечку памяти, которая происходит постоянно, когда сервер включен. Так же, рестарты избавляют от медленных прогрузок мира и багов с постройками. Обычно рестарт происходит в течение 2-5 минут.<br><br>\
<b>Вопрос</b>: Могу ли я зайти с пиратской версии игры?<br>\
<b>Ответ</b>: Нет, только лицензионная версия игры.<br><br>\
<b>Вопрос</b>: Почему все системные сообщения сервера на английском?<br>\
<b>Ответ</b>: Переключите ваш стандартный язык клиента на русский! Любой отличный от русского языка игрок, автоматически получает сообщения на англ. (либо используйте \'lang ru\' в консоли F1)</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Что входит в KIT</span><br>\
	 <blockquote class="spoil-Untext">Вы можете ознакомится с китами<a href="javascript:;" onclick="Open(\'kit-free\');"> здесь.</a> Либо можете обратится к альбому со скринами в нашей <a href="https://vk.com/album-124254208_233413146" target="blank">группе Вк</a></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как забиндить команды</span><br>\
	 <blockquote class="spoil-Untext"><a href="javascript:;" onclick="Open(\'help\');">Как биндить основные команды на нашем сервере</a></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как получить бесплатные привилегии</span><br>\
	 <blockquote class="spoil-Untext">Вы участвуете в ивентах которые мы настроили на сервере почти на каждый час и получаете классные ресурсы и предметы!<br>\
Но вы можете пойти ещё дальше и принять участие в наших уникальных ивентах и получать настоящие платные привилегии из магазина абсолютно бесплатно!<br>\
Так же вы можете учавствовать в наших супер ивентах которые проходят на протяжении всего вайпа и уже получать настоящие деньги на вашу банковскую карту или на баланс магазина!</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Уникальные плагины</span><br>\
	 <blockquote class="spoil-Untext">О наших уникальных собственных плагинах вы можете прочитать <a href="javascript:;" onclick="Open(\'plugins\');">здесь</a></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" onclick="Open(\'serv\');" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Можно подробнее узнать О Серверах?</span><br>\
	 <blockquote class="spoil-Untext">- -</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Я купил несколько разных/одинаковых групп, могу ли я их активировать одновременно?</span><br>\
	 <blockquote class="spoil-Untext">Да, все группы совместимы друг с другом. Если в группах есть похожие привилегии, но с разными значениями (время тп, рейты), то выбираться будет лучшее.<br>\
Если Вы купите и активируете одновременно Prem и Elite, то рейты и время тп у Вас будут от группы Elite. (и не важно, в каком порядке активировать).<br><br>\
<i class="fa fa-info-circle"></i> Так же если вы купили 2 одинаковые группы вы можете либо активировать сначала одну, а через неделю другую либо вы можете активировать сразу несколько копий одной группы. Время будет складываться</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Можно получить промокод или скидку?</span><br>\
	 <blockquote class="spoil-Untext">Промокод может выпускаться на сутки ограниченным тиражом сразу после вайпа. Узнать его можно только подписавшись на уведомления о вайпе в нашей <a href="https://vk.com/grandrust_server?w=app5748831_-124254208" target="blank">группе Вконтакте</a><br><br>\
<i class="fa fa-info-circle"></i> Промокод будет приходить вам в личных сообщениях сразу вместе с проведением вайпа, обычно каждый четверг в 11:00 МСК<br><br>\
Так же промокод получают те кто первый зашёл на сервер сразу после вайпа (обычно 100-150 чел.) и поиграл на сервере 10-20 минут. Вы получите уведомление при переходе по которому Вам перечислят деньги на баланс привязанного аккаунта в магазине<br><br>\
<i class="fa fa-info-circle"></i> Внимание! В таком случае аккаунт с которого вы играете должен быть зарегистрирован в магазине! Подробнее о сроках/местах/порядке получения приза мы сообщаем в каждом посте о вайпе в нашей <a href="https://vk.com/grandrust_server" target="blank">группе Вконтакте</a><br><br></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Как забрать предметы на сервере купленные в магазине?</span><br>\
	 <blockquote class="spoil-Untext">Откройте корзину на сервере с помощью кнопки в виде коробки <i class="fa fa-box-open"></i> слева вверху экрана или командой /store в чат. Перед Вами появится список всех Ваших покупок. <br><br>\
<i class="fa fa-info-circle"></i> Их можно получить только если у вас есть достаточно места в инвентаре для выдачи и только в своей билде!</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Когда вайп внутриигрового склада с ивентов?</span><br>\
	 <blockquote class="spoil-Untext">Он не очищается ни на одном сервере! Более того он синхронизирован на любом из наших серверов так, чтобы вы могли забрать ваши накопленные вещи на любом удобном сервере в любой удобный момент, прямо как вещи из донат магазина.</blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Я увидел нарушителей, что делать?</span><br>\
	 <blockquote class="spoil-Untext">Если вы заметили игроков превышающих лимит в команде либо нарушающих иные правила, пожалуйста, сделайте скрин либо запомните ники игроков и предоставьте нам через группу ВК.<br><br>\
<i class="fa fa-info-circle"></i> Так же, если вас очень смутил, убивший вас, подозреваемый читер, нажмите на соответствующую кнопку report на экране смерти, все ваши заявки очень тщательно рассматриваются нашим патрулём и мы проводим принудительную проверку всех подозреваемых вами игроков</blockquote>\
     </div></div>\
<!--<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head"></span><br>\
	 <blockquote class="spoil-Untext"></blockquote>\
     </div></div>\
<div class="x-spoiler">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Название</span><br>\
	 <blockquote class="spoil-Untext">Описание</blockquote>\
     </div></div>-->'
};

curcontent["rules"] = {
	xhead: 'Правила',
	xcon: '<div class="xbox_custom_rules"><ul><p class="MsoNormal"><span>Основная информация</span></p>\
<p><li>НЕЗНАНИЕ ПРАВИЛ НЕ ОСВОБОЖДАЕТ ВАС ОТ ОТВЕТСТВЕННОСТИ.</li></p>\
<p><li>Администраторы сервера имеют право изменить или дополнить правила сервера в будущем.</li></p>\
<p><li>Проверяющие и администрация сами выбирают наказание для игрока в зависимости от степени нарушения и обстоятельств. Игрок может отделаться простым предупреждением, а может и попасть в бессрочный бан.</li></p>\
<p><li>Проверяющие отвечают только за проверку на стороннее ПО у игроков, при наличии жалоб или репортов на него. Отказ от проверки карается баном. При вызове у вас появляется уведомление на экране. Вызовы через чат не производятся</li></p>\
<p><li>Вы несете ответственность за все свои аккаунты. Получив бан за нарушение, вы получите его и на последующих аккаунтах.</li></p><br>\
<p class="MsoNormal"><span>Игровой процесс</span></li></p>\
<p><li>Запрещено использовать/хранить/приобретать/распространять стороннее ПО или любые другие средства, позволяющие получить преимущество над другими игроками. Использование услуг читеров/макросников приравнивается к хранению.</li></p>\
<p><li>Запрещено превышать лимит игроков в команде, установленный сервером. (см. название сервера MAX 1/2/3)</li></p>\
<p><li>Игрокам запрещено строить дома в текстурах, а так же застраивать игровые локации, препятствующие к использованию РТ.</li></p>\
<p><li>Запрещено строиться или хранить лут в текстурах/скалах/камнях и подобных недоработках карт.</li></p>\
<p><li>Игрокам запрещено строить игровые постройки и предметы багом/недоработкой например в целях сделать несколько предметов друг в друге, слишком близко или с невозможностью уничтожения.</li></p>\
<p><li>Запрещено заменять напарника, при условии, что основной продолжает с вами играть.</li></p>\
<p><li>Запрещено строить "усы" к дому дальше 10 квадратов в длину (треугольники засчитываются так же). На первый раз игрок может отделаться как предупреждением с последующим самостоятельным уничтожением, либо лишние "усы" уничтожает администратор. При повторном нарушении усов (свыше 5 квадратов) дом может подлежать ремуву, либо повтору вышеперечисленных действий.</li></p>\
<p><li>При обнаружении бага или недоработки игры/сервера незамедлительно сообщите администрации об этом через сообщение в нашу группу Вк.</li></p>\
<p style="text-align: center;"><u>БАН – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>\
<p><u><br>\
</u></p>\
<p class="MsoNormal"><span>Игровой чат</span></p>\
<p><li>Запрещен флуд. Флудом считается отправка нескольких одинаковых сообщений и/или команд в короткий промежуток времени.</li></p>\
<p><li>Запрещено употребление нецензурных выражений и оскорбления других игроков.</li></p>\
<p><li>Запрещено проявление расизма в любых формах.</li></p>\
<p><li>Запрещено оскорбление администрации в любых формах.</li></p>\
<p><li>Запрещено оскорбление сервера в целом.</li></p>\
<p><li>Запрещена реклама сторонних проектов в любой форме.</li></p>\
<p><li>Запрещена провокация/клевета других игроков.</li></p>\
<p><li>Запрещена клевета, дезинформация, наговор, ложь на игроков/администрацию и проект в целом.</li></p>\
<p><li>Запрещено выдавать себя за администратора или проверяющего.</li></p>\
<p><li>Запрещено использование "ADMIN" или "MODER", или похожие слова в нике.</li></p>\
<p><li>Намеренное изменение нецензурной речи и оскорблений для обхода автоматического мута.</li></p>\
<p style="text-align: center;"><u>БАН/МУТ – за нарушение вышеперечисленных правил на всех серверах GRAND RUST.</u></p>\
<p><u><br>\
</u></p>\
<p class="MsoNormal"><span>Дополнительная информация</span></p>\
<p><li>На проекте есть только администрация и проверяющие (игроки ответственные за проверку на стороннее ПО).</li></p>\
<p><li>Администрации запрещается играть на сервере как простой игрок.</li></p>\
<p><li>Проверяющие могут играть на серверах как игрок, но они не следят за игрой с превышением лимита.</li></p>\
<p><li>Запрещено нарушать правила ивентов прописанных в разделе "Правила участия в ивентах" ниже, в /help на серверах либо в отдельных командах плагинов, например /tc</li></p>\
<p><li>Администрация не несет ответственности за обмены на сервере, не отвечает за то кому Вам доверять.</li></p>\
<p><li>Если вы заметили игроков превышающих лимит в команде, или нарушающих иные правила, пожалуйста, сделайте скрин либо запомните ники игроков и предоставьте нам через <a href="https://vk.me/grandrust_server" target="blank">группу ВК.</a></li></p>\
<p><li>Администрация и проверяющие имеют право забанить весь состав друзей/сокланов за игру с читером, за игру с макросами при повторном аккаунте макросника к этим же друзьям а так же за игру с использованием услуг читеров.</li></p>\
<p><li>Администрация и проверяющие имеют право забанить вас при наличии веских доказательств при проверке на другом проекте.</li></p>\
<p><li>Вы можете быть забанены автоматической системой обнаружения подозрительных действий игрока, если вы не совершали противоправных действий, пожалуйста, напишите нам в группу ВК если вы были забанены по ошибке.</li></p>\
<p><li>Вещи, купленные в магазине, не подлежат возврату, обмену или переносу, если они были получены на сервере через корзину.</li></p>\
<p><li>Вещи, услуги или баланс не подлежат продаже или обмену, в том числе на денежные средства, выплата денежного эквивалента промокода не производится.</li></p>\
<p><li>Вам никто и ничего не должен, а так же ни чем не обязан.</li></p>\
<p><li>Администраторы и проверяющие сервера не возвращают утерянный лут.</li></p>\
<p><li>Игровой сервер может быть остановлен, перезагружен или удален в любое время.</li></p><br>\
<p class="MsoNormal"><span>Правила участия в ивентах</span></p>\
<p><li>Нашивки</li></p>\
<p>- Запрещено накручивать очки нашивок на друзьях.</p>\
<p>- Запрещено набивать на одном и том же игроке очки свыше 3 раз.</p>\
<p>- Запрещено абузить нашивки, например нашивки за «Уникальный шкаф».</p>\
<p>- Игрок может получить денежный приз за ивент "Нашивки" только один раз.</p>\
<p>- Игроки могут получить денежный приз за ивент на одном конкретном сервере только один раз за глобал вайп нашивок. (Актуальные победители всегда перечислены в нашей группе Вк в постах и в специальном <a href="https://vk.com/@grandrust_server" target="blank">разделе статей</a>)</p>\
<p>- Если вы намереваетесь выиграть денежный приз за ивент, пожалуйста, внимательно ознакомьтесь с настоящими правилами, это очень важно.</p>\
<p>- Игрок может получить денежный приз (или его эквивалент) за ивент только после проверки всех требований которые победитель выполнит в соответствии с настоящими правилами.</p>\
<p><li>Уникальный шкаф</li></p>\
<p>- Запрещено покупать, отдавать и т д. шкаф. Очки за шкаф зачтутся только в ходе честной игры.</p>\
<p>- Игрок заабузивший нашивку, теряет возможность принять повторное участие от 30 дней, а так же не получает нашивку.</p>\
<p>- Игрок, продавший или отдавший шкаф, теряет возможность принять повторное участие от 30 дней.</p>\
<p>- Запрещено ставить шкаф в чужом доме для последующего уничтожения.</p>\
<p>- Запрещено уничтожать шкаф друга или заранее договорившись с игроком.</p>\
<p>- Запрещено повышать очки чужого шкафа.</p>\
<p>- Игрок, у которого уничтожили шкаф, теряет 50 очков.</p>\
<p>- Победители, выполнившие настоящие правила, будут опубликованы в нашей группе Вк (в посте о глобал вайпе), только опубликованные в посте игроки получат нашивки в течение часа после публикации.</p><br>\
<p><li>Дуэли</li></p>\
<p>- Игрок, забравший каким-то образом с арены/дуэли оружие или сет, получает бан. Сообщите нам, если у вас получилось если не хотите получить бан сами.</p><br>\
<p class="MsoNormal"><span>Проверка Подозреваемых</span></p>\
<p><li>Проверка на стороннее ПО проводится, только если вы на сервере, не АФК и не имеете Рейд Блок.</li></p>\
<p><li>Проверки проходят только один на один с проверяющим или с несколькими проверяющими.</li></p>\
<p><li>Как только вас вызвали на проверку - вам даётся до 10 минут, чтобы связаться с проверяющим, действуя инструкциям на экране, в противном случае вы можете получить блокировку.</li></p>\
<p><li>Связь происходит посредством Skype/Discord с демонстрацией проверяющему вашего экрана.</li></p>\
<p><li>Если вы покидаете сервер после вызова, не предоставив контакты для связи и не пройдя проверку, вы получаете бан на всех серверах.</li></p>\
<p><li>Проверка осуществляется в автоматическом режиме с помощью программы RustCheatCheck, скачать которую вы можете на официальном сайте RustCheatCheck.ru, вы так же имеете право отказаться скачивать её, но в таком случае нам придётся заблокировать вас.</li></p>\
<p><li>Проверка так же может проходить через программы AnyDesk и TeamViewer, если ваше соединение с интернетом не может показывать хорошее качество связи.</li></p>\
<p><li>Информация, которая может быть получена при вашей проверке не распространяется, за исключением результатов проверки, которые могут быть затребованы администрацией других проектов, так же использующих сервис RustCheatCheck для своих проверок.</li></p>\
<p><li>Так же мы можем затребовать результаты ваших предыдущих проверок других проектов, так же использующих сервис RustCheatCheck, которые приобщаются к вашему делу (при наличии веских доказательств) и могут повлиять на окончательное решение.</li></p>\
<p><li>Предварительное решение после проверки озвученное проверяющим может отличатся от окончательного, принятого администрацией.</li></p>\
<p><li>Если вы не согласны с окончительным решением, принятым не в соответствии настоящих правил, вы можете затребовать у главного администратора материалы дела о вашей блокировке направив сообщение в наше официальное сообщество <a href="https://vk.com/grandrust_server" target="blank">GRAND RUST.</a></li></p><br>\
</ul></div></div>'
};

curcontent["help"] = {
	xhead: 'Команды сервера и бинды',
	xcon: '<div style="padding: 0px 10px;">\
Разработчики убрали возможность биндить команды, где присутствует пробел.<br>\
Этот бинд стал не рабочим bind клавиша chat.say /home 1.\
Мы кое-что изменили, теперь вы можете биндить хом следующим образом.<br>\
Наример: ставите хомку "/sethome 1", далее пишите в консоль такую команду bind клавиша "home 1" и бинд работает!<br><br>\
<h4>Так же доступны следующие быстрые бинды</h4>\
<div class="commandblock">\
\
<span class="MsoCommand">bind h home название</span> Запрос тп на хом.<br>\
<span class="MsoCommand">bind t tpr имя или steam часто запрашиваемого товарища</span> Отправить тп на товарища.<br>\
<span class="MsoCommand">bind p remove</span> Включение/Выключение ремувера ваших построек.<br>\
<span class="MsoCommand">bind m map.open</span> Открыть/Закрыть карту.<br>\
<span class="MsoCommand">bind u building.upgrade</span> Автоматическое улучшение строений.<br>\
<span class="MsoCommand">bind k kits.open</span> Открыть меню китов.<br>\
<span class="MsoCommand">bind i skin</span> Открыть меню скинов.<br>\
<span class="MsoCommand">bind o store.opencart</span> Открыть корзину магазина.<br>\
<span class="MsoCommand">bind o store.giveitemall</span> Быстро забрать всё из корзины магазина.<br>\
<span class="MsoCommand">bind l skills</span> Открыть меню прокачек.<br>\
<span class="MsoCommand">bind l xp</span> Открыть меню внутриигровой валюты.</div><br>\
<!--<i class="fa fa-info-circle"></i>--> Так же если в этом списке нет ваших любимых команд, вы всё ещё можете забиндить их традиционно. (Кавычки обьязательны)<br>\
<div class="commandblock">\
<span class="MsoCommand">bind f7 chat.say "/skin"1</span> Скины.<br>\
<span class="MsoCommand">bind mouse4 chat.say "/back"1</span> Скрафтить Доп. Рюкзак.</div>\
<h4>Бинды для отдельных привилегий</h4>\
<div class="commandblock">\
<!--<span class="MsoCommand">bind b backpack.open</span> Открыть Доп. Рюкзак.<br>-->\
<span class="MsoCommand">bind b back</span> Скрафтить Доп. Рюкзак.<br>\
<span class="MsoCommand">bind c rec</span> Открыть окно переработчика.</div>\
<!--<i class="fa fa-info-circle"></i>--> На каждую команду можно назначить именно свою, удобную для Вас кнопку.<br>\
<br>\
<h4>ЧАТ команды телепорта</h4>\
<div class="commandblock">\
<span class="MsoCommand">/tpr ник</span> Отправить запрос на телепортацию к игроку.<br>\
<span class="MsoCommand">/tpa</span> Принять запрос на телепортацию.<br>\
<span class="MsoCommand">/tpc</span> Отменить/отклонить телепортацию.<br>\
<span class="MsoCommand">/sethome название дома</span> Сохранить местоположение дома.<br>\
<span class="MsoCommand">/removehome название дома</span> удалить дом с указанным названием.<br>\
<span class="MsoCommand">/home list</span> Показать список Ваших домов.<br>\
<span class="MsoCommand">/home название дома</span> Телепортироваться на дом с указанным названием.</div><br>\
<h4>Команды системы друзей и кланов</h4>\
<div class="commandblock">\
<span class="MsoCommand">/friend add ник</span> Отправить игроку запрос на дружбу.<br>\
<span class="MsoCommand">/friend accept</span> Принять запрос дружбы.<br>\
<span class="MsoCommand">/friend deny</span> Отклонить запрос дружбы.<br>\
<span class="MsoCommand">/friend remove ник</span> Удалить друга.<br>\
<span class="MsoCommand">/friend list</span> Показать список друзей.<br>\
<span class="MsoCommand">/ff</span> Переключение урона по друзьям и соклановцам.<br>\
<span class="MsoCommand">/ff on/off</span> Включить/Выключить урон по друзьям и соклановцам.</div>\
<br>\
<h4>Команды китов</h4>\
<div class="commandblock">\
<span class="MsoCommand">/kit</span> Показать меню наборов.<br>\
<!--<span class="MsoCommand">/kits</span> Показать в чате список наборов.<br>-->\
<span class="MsoCommand">/kit название</span> Получить набор с указанным названием.(полезно для бинда)<br></div>\
<h4>Список команд по привилегиям</h4>\
<div class="commandblock">\
<span class="MsoCommand">/skin</span> Открыть окно выбора скинов.<br>\
<span class="MsoCommand">/sil http://ссылка на картинку.png</span> Поставить картинку из интернета на табличку.<br><a href="https://pic.moscow.ovh/images/2020/10/17/3b1fdfa89607caa0b729b3c88a06183d.jpg" target="blank">(как получить ссылку на картинку)</a><br>\
<span class="MsoCommand">/chat</span> Все доступные команды по чату.<br>\
<span class="MsoCommand">/chat color</span> Сменить цвет ника.<br>\
<span class="MsoCommand">/chat prefix</span> Смена префикса перед ником.<br>\
<span class="MsoCommand">/rec</span> Открыть окно переработчика.<br>\
<span class="MsoCommand">/b</span> Окно рюкзака.</div>\
<br>\
<h4>Полезные команды</h4>\
<div class="commandblock">\
<span class="MsoCommand">/block</span> Список заблокированных предметов после вайпа.<br>\
<span class="MsoCommand">/pinfo</span> Узнать оставшееся время ваших платных услуг.<br>\
<!-- <span class="MsoCommand">/us</span> Зарепортить дом на использование усов выше нормы установленной сервером. (>10 квадратов радиусом)<br> -->\
<span class="MsoCommand">/vk</span> Привязать ваш VK для уведомлений о рейде или вайпе.<br>\
<span class="MsoCommand">/map</span> Открыть/Закрыть карту. (лучше забиндить по примеру выше)<br>\
<span class="MsoCommand">/case</span> Открыть ваш склад внутриигровых накоплений.<br>\
<span class="MsoCommand">/skill</span> Открыть окно прокачек.<br>\
<span class="MsoCommand">/t ник</span> Отправить запрос на трейд.<br>\
<span class="MsoCommand">/t yes</span> Принять трейд.<br>\
<span class="MsoCommand">/votemute ник</span> Проголосовать за мут игрока.<br>\
<span class="MsoCommand">/voteban ник</span> Проголосовать за бан игрока.<br>\
<span class="MsoCommand">/dm</span> Включение/Выключение килл бара.<br>\
<span class="MsoCommand">/hit</span> Включение/Выключение хит маркера.<br>\
<span class="MsoCommand">/tc</span> ТОП по ивентам шкафов.<br>\
<span class="MsoCommand">/who</span> узнать есть ли в доме уникальный шкаф (смотря на дом).<br>\
<span class="MsoCommand">/help</span> узнать всю информацию о сервере в том числе о биндах.</div>'
};


var kit_prem = ['stones', 5000, 10000, 13000, 
				'wood', 4000, 10000, 12000,
				'metal.fragments', 1500, 3000, 3500,
				'lowgradefuel', 500, 1500, 2000,
				'cloth', 500, 1000, 1500,
				'leather', 500, 1000, 1500,
				'metal.refined', 100, 200, 300,
				'gears', 6, 30, 40,
				'techparts', 5, 10, 15,
				'sewingkit', 20, 30, 40,
				'metalblade', 10, 15, 20,
				'metalpipe', 10, 20, 25,
				'metalspring', 10, 25, 35,
				'sheetmetal', 10, 15, 20,
				'smgbody', 3, 4, 6,
				'riflebody', 3, 4, 6,
				'semibody', 3, 4, 5,
				'roadsigns', 10, 25, 35,
				'rope', 10, 25, 35,
				'tarp', 10, 25, 35,
				'propanetank', 10, 25, 35,
				'scrap', 50, 80, 100,
				'pistol.python', null, null, null,
				'ammo.pistol', 100, 100, 100,
				'hatchet', null, null, null,
				'pickaxe', null, null, null,
				'supply.signal', null, null, null,
				'hazmatsuit', null, null, null];
				
curcontent["kit-prem"] = {
	xhead: 'Что входит в киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary" onclick="Open(\'kit-free\', false);">Общие</button>\
	<button class="btn btn-secondary active">Prem</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-wars\', false);">Wars</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-elite\', false);">Elite</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-king\', false);">King</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-grand\', false);">Grand</button></div>\
	<div class="xbox_custom_kits" ><div class="serverheader">KIT PREMIUM (по привилегии)</div>\
<div class="kit_set"><div class="kit-items">'
};



curcontent["kit-wars"] = {
	xhead: 'Что входит в киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary" onclick="Open(\'kit-free\', false);">Общие</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-prem\', false);">Prem</button>\
	<button class="btn btn-secondary active">Wars</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-elite\', false);">Elite</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-king\', false);">King</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-grand\', false);">Grand</button></div>\
	<div class="xbox_custom_kits" ><div class="serverheader">KIT WARS (по привилегии)</div>\
<div class="kit_set"><div class="kit-items">'
};

curcontent["kit-elite"] = {
	xhead: 'Что входит в киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary" onclick="Open(\'kit-free\', false);">Общие</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-prem\', false);">Prem</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-wars\', false);">Wars</button>\
	<button class="btn btn-secondary active">Elite</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-king\', false);">King</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-grand\', false);">Grand</button></div>\
	<div class="xbox_custom_kits" ><div class="serverheader">KIT ELITE (по привилегии)</div>\
<div class="kit_set"><div class="kit-items">'
};


curcontent["kit-king"] = {
	xhead: 'Что входит в киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary" onclick="Open(\'kit-free\', false);">Общие</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-prem\', false);">Prem</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-wars\', false);">Wars</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-elite\', false);">Elite</button>\
	<button class="btn btn-secondary active">King</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-grand\', false);">Grand</button></div>\
	<div class="xbox_custom_kits" ><div class="serverheader">KIT KING (по привилегии)</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/stones.png">\
<div class="kit-item__quantity">x15000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/wood.png">\
<div class="kit-item__quantity">x15000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.fragments.png">\
<div class="kit-item__quantity">x4500</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/lowgradefuel.png">\
<div class="kit-item__quantity">x2500</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/cloth.png">\
<div class="kit-item__quantity">x2500</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/leather.png">\
<div class="kit-item__quantity">x2500</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.refined.png">\
<div class="kit-item__quantity">x500</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/gears.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/techparts.png">\
<div class="kit-item__quantity">x20</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sewingkit.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalblade.png">\
<div class="kit-item__quantity">x25</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalpipe.png">\
<div class="kit-item__quantity">x35</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalspring.png">\
<div class="kit-item__quantity">x40</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sheetmetal.png">\
<div class="kit-item__quantity">x25</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/smgbody.png">\
<div class="kit-item__quantity">x7</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/riflebody.png">\
<div class="kit-item__quantity">x7</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/semibody.png">\
<div class="kit-item__quantity">x7</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/roadsigns.png">\
<div class="kit-item__quantity">x40</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/rope.png">\
<div class="kit-item__quantity">x40</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/tarp.png">\
<div class="kit-item__quantity">x40</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/propanetank.png">\
<div class="kit-item__quantity">x40</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/scrap.png">\
<div class="kit-item__quantity">x150</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/chainsaw.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/rifle.ak.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/ammo.rifle.png">\
<div class="kit-item__quantity">x100</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/uberpickaxe.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/uberhatchet.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/supply.signal.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
</div></div></div>\
<div class="xbox_custom_kits" ><div class="serverheader">Дополнительный кит</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/coffeecan.helmet.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/roadsign.jacket.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://pic.moscow.ovh/images/2020/10/17/f3a7b76c61bfef2d88365e5fb5b6187d.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://pic.moscow.ovh/images/2020/10/17/2470d515603974ec5cb7c9871efd9284.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/850465965368818420/7BFE0E70C0B8BB0DE8EC3B39A7EE169594C1359F/"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/largemedkit.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/syringe.medical.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/blueberries.png">\
<div class="kit-item__quantity">x20</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/candycane.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sulfur.png">\
<div class="kit-item__quantity">x10000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/gunpowder.png">\
<div class="kit-item__quantity">x3000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.fragments.png">\
<div class="kit-item__quantity">x5000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/workbench1.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/workbench2.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/research.table.png"></div></div>\
</div></div></div>'
};

curcontent["kit-grand"] = {
	xhead: 'Что входит в киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary" onclick="Open(\'kit-free\', false);">Общие</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-prem\', false);">Prem</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-wars\', false);">Wars</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-elite\', false);">Elite</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-king\', false);">King</button>\
	<button class="btn btn-secondary active">Grand</button></div>\
	<div class="xbox_custom_kits" ><div class="serverheader">KIT GRAND (по привилегии)</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/stones.png">\
<div class="kit-item__quantity">x20000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/wood.png">\
<div class="kit-item__quantity">x20000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.fragments.png">\
<div class="kit-item__quantity">x6000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/lowgradefuel.png">\
<div class="kit-item__quantity">x3000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/cloth.png">\
<div class="kit-item__quantity">x3000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/leather.png">\
<div class="kit-item__quantity">x3000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.refined.png">\
<div class="kit-item__quantity">x800</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/gears.png">\
<div class="kit-item__quantity">x60</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/techparts.png">\
<div class="kit-item__quantity">x25</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sewingkit.png">\
<div class="kit-item__quantity">x60</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalblade.png">\
<div class="kit-item__quantity">x30</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalpipe.png">\
<div class="kit-item__quantity">x45</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metalspring.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sheetmetal.png">\
<div class="kit-item__quantity">x30</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/smgbody.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/riflebody.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/semibody.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/roadsigns.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/rope.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/tarp.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/propanetank.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/scrap.png">\
<div class="kit-item__quantity">x200</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/ammo.rifle.png">\
<div class="kit-item__quantity">x200</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/chainsaw.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/rifle.ak.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/rifle.lr300.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/uberpickaxe.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/uberhatchet.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/supply.signal.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
</div></div></div>\
<div class="xbox_custom_kits" ><div class="serverheader">Дополнительный кит</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.facemask.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.plate.torso.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://pic.moscow.ovh/images/2020/10/17/d3250281cbbf90af10d586b9dc8155a4.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://pic.moscow.ovh/images/2020/10/17/e3ad719cf5573e0e776c0423036355cc.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://pic.moscow.ovh/images/2020/10/17/5f030d595e5d89c650103e545a7ff71d.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/largemedkit.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/syringe.medical.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/blueberries.png">\
<div class="kit-item__quantity">x20</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/candycane.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hazmatsuit.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sulfur.png">\
<div class="kit-item__quantity">x15000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/gunpowder.png">\
<div class="kit-item__quantity">x5000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/metal.fragments.png">\
<div class="kit-item__quantity">x10000</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/workbench1.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/workbench2.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/workbench3.png"></div></div>\
</div></div></div>'
};

curcontent["kit-free"] = {
	xhead: 'Что входит в бесплатные киты',
	xcon: '<div class="store-categories">\
	<button class="btn btn-secondary active">Общие</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-prem\', false);">Prem</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-wars\', false);">Wars</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-elite\', false);">Elite</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-king\', false);">King</button>\
	<button class="btn btn-secondary" onclick="Open(\'kit-grand\', false);">Grand</button></div>\
<div class="xbox_custom_kits" >\
<div class="serverheader">Бомж</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/851593237065046314/C4394B54330D8C6C0D1DC624FE5F20F448880603/?imw=268&imh=268&impolicy=Letterbox"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/821190300748591786/D677BA94E2D706E033F9BB3B78B154364E17EAE0/?imw=268&imh=268&impolicy=Letterbox"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/90478291046828677/21E21062B5573D3ACBCD9DBFAB2571923538CB90/?imw=637&imh=358&impolicy=Letterbox"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/956350181140504911/CB13074BC7EE6C818347E10CF8ECDBFA47F1E9A3/?imw=268&imh=268&impolicy=Letterbox"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://steamuserimages-a.akamaihd.net/ugc/956350181140521182/4D408A70093BFEF6C339E99628E4907AC069E253/?imw=268&imh=268&impolicy=Letterbox"></div></div>\
</div></div>\
<div class="serverheader">Starter</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/furnace.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/sleepingbag.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/campfire.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/building.planner.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/hammer.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/cactusflesh.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/stonehatchet.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/stone.pickaxe.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/bandage.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/syringe.medical.png">\
<div class="kit-item__quantity">x2</div></div></div>\
</div></div>\
<div class="serverheader">Med</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/bandage.png">\
<div class="kit-item__quantity">x10</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/syringe.medical.png">\
<div class="kit-item__quantity">x2</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/largemedkit.png"></div></div>\
</div></div>\
<div class="serverheader">Food</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/blueberries.png">\
<div class="kit-item__quantity">x2</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/wolfmeat.cooked.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/meat.pork.cooked.png">\
<div class="kit-item__quantity">x5</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/smallwaterbottle.png">\
<div class="kit-item__quantity">150ml</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/smallwaterbottle.png">\
<div class="kit-item__quantity">150ml</div></div></div>\
</div></div>\
<div class="serverheader">Hunter</div>\
<div class="kit_set"><div class="kit-items">\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/arrow.wooden.png">\
<div class="kit-item__quantity">x50</div></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/bow.hunting.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/spear.wooden.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/spear.stone.png"></div></div>\
<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/knife.bone.png"></div></div>\
</div></div></div>'
};

curcontent["plugins"] = {
	xhead: 'Уникальные плагины и ивенты',
	xcon: '<div class="xbox_custom_plugins xbox_custom_rules">\
<!--<a class="xbox_custom_photo"><img src="https://pp.userapi.com/c637530/v637530980/5d5b4/0uh_67rtFgo.jpg"></a>-->\
<blockquote class="pluginsheader"><center>Радиоактивный дом.</center></blockquote>\
<p>Дом появляется ежедневно, с промежутком 2 часа, координаты дома указаны в чате и на карте. \
Суть проста – авторизоваться в шкафу, удержать свою авторизацию в течение 10 минут. \
После чего вам будет доступен ящик с ресурсами. Ресурсы выпадают рандомно, в зависимости от времени проведения вайпа, ценность ресурсов будет только увеличиваться. \
Ах да, забыли сообщить. Там будет радиация, много радиации.</p>\
<br>\
<blockquote class="pluginsheader"><center>Нашивки (Ежемесячный ивент).</center></blockquote>\
<p>Открывайте нашивки выполняя задания. За каждую разблокированную нашивку, вы будете получать рандомные призы. \
Всего нашивок 15, если вам удастся разблокировать 15 нашивок раньше всех, вы получите 10.000 рублей на карту или qiwi кошелёк.</p>\
<br>\
<blockquote class="pluginsheader"><center>Суперигра (Еженедельный ивент)</center></blockquote>\
<p>Если у тебя нет денег но хочется поиграть с привилегией, ты всегда можешь принять участие в СУПЕРИГРЕ и выиграть. За добычу дерева, камня, серную и железную руду, \
тебе будет выпадать случайное число от 1 до 5. Задача набрать определённое количество баллов на каждом из ресурсов. Всего ресурсов 4. За каждые набранные ресурсы, \
ты получаешь внутриигровую валюту и можешь потратить её в магазине /shop. Если наберёшь баллы сразу на всех 4-х ресурсах, получишь случайную привилегию Premium, Wars, Elite, King или Grand на 7 дней. Удачи!</p>\
<br>\
<blockquote class="pluginsheader"><center>Уникальный шкаф (Еженедельный ивент).</center></blockquote>\
<p>Ивент, в котором могут принять участие все игроки, проведя на сервере не менее 5 часов. \
Игрок получает уникальный шкаф, который бережёт от уничтожения, в то же время сам старается найти \
и уничтожить как можно больше вражеских шкафов чтобы получить за них очки в топе, тем самым игроки, попавшие в топ 3, и заработавшие больше 0 баллов, получают бонус в виде баланса на магазин.</p>\
<br>\
<blockquote class="pluginsheader"><center>Дуэли.[Временно не доступны!]</center></blockquote>\
<p>На всех серверах установлены Дуэли, на которых вы можете играть просто так или же делать ставки! Дуэлиться можно даже во время блокировки предметов.</p>\
<br>\
<blockquote class="pluginsheader"><center>Система XP, Игровая валюта, Способности и Кейсы.</center></blockquote>\
<p>Играя на серверах, вы будете прокачивать свой уровень выполняя различные действия, как при системе ХР. \
Прокачивая уровень вам будут разблокироваться кейсы, которые вы сможете открывать ежедневно. \
Всё содержимое кейсов попадает на склад и храниться там пока вы это не заберёте. \
С прокачкой уровней, вам начисляются Гранды, которые вы можете потратить на покупку необходимых товаров в магазине или прокачку способностей.</p>\
<br>\
<blockquote class="pluginsheader"><center>ПРМ.</center></blockquote>\
<p>Имеется свой собственный ресурс, переработчик и квесты для нахождения редких деталей ПРМ.</p>\
<br>\
<blockquote class="pluginsheader"><center>Уникальные металлы.</center></blockquote>\
<p>Имеются свои собственные уникальные металлы, для переработки в переработчике и ПРМ. После переработки выпадает сера, металл, МВК и другой ценный лут.</p>\
<br>\
<blockquote class="pluginsheader"><center>Домашнее кaзино.</center></blockquote>\
<p>Вы можете собрать детали от кaзино и приобрести лицензию на установку игрового стoла в нашем внутриигровом магазине. \
После этого сможете поставить его у себя дома и не бегать с драгоценным ресами в общественное кaзино. К тому же мы добавили лицензии не только на скрап но и на другие ценные ресурсы! \
Покупая их вы сможете ставить разные предметы не выходя из дома!\
<i class="fa fa-info-circle"></i> Более подробная информация во внутриигровом магазине во вкладке кaзино.</p>\
<br>\
<blockquote class="pluginsheader"><center>Система XP возможность вывода.</center></blockquote>\
<p>Теперь вы можете выводить ваши накопления XP в электронном кошельке ввиде монеток в инвентарь. <br>\
Вывод доступен через меню внутриигровой валюты и левела в верхнем правом углу экрана. Чтобы внести монеты обратно на счёт нужно набрать от 10 шт. и нажать Upgrade на предмете. <br>\
<i class="fa fa-info-circle"></i> Более подробного вы можете ознакомится в самом меню внутриигровой валюты и левела. <br><br>\
Что это даёт: <br>\
- Теперь вы сможете поделится с другом вашими XP, например, если вы уже прокачали способности, а вашему другу не много не хватило. <br>\
- Теперь можно трейдить XP как ресурс на интересующие вас предметы. <br>\
- Вы можете зарабатывать XP добывая его даже во время отсутствия на сервере с помощью прибора под названием Майнинговая ферма. </p><br>\
<br>\
<blockquote class="pluginsheader"><center>Майнинговая ферма.</center></blockquote>\
<p>Для сборки Фермы необходимо: устройство для выработки энергии (Малый генератор, Cолнечная панель или Ветрогенератор) \
Разветвитель, Мигалка, Аккумулятор, Радиопередатчик.</p>\
<div class="x-spoiler" style="width: 695px;margin-left: 43px;">\
<input class="spoil-button" type="checkbox" tabindex="-1">\
     <div class="spoil-box"><span class="spoil-close fa"></span><span class="spoil-open fa"></span><span class="spoil-head">Пример подключения смотреть на картинке...</span><br>\
	 <blockquote class="spoil-Untext"><a class="xbox_custom_photo"><img src="https://media.discordapp.net/attachments/619458176483328020/621435647089049659/generator_wind_scrap.png?width=910&height=512"></a></blockquote>\
     </div></div><br>\
<p>После того как всё было собрано и подключено, задайте на Радиопередатчике частоту 1001 и нажмите Применить. <br>\
Если электро цепь была собрана правильно, сразу после подачи питания на Аккумулятор,<br>\
возле него появится Почтовый ящик, в который и будут майниться ваши Гранды.<br>\
Как только заряд в Аккумуляторе накопит энергии на 6 минут,<br>\
в Почтовом ящике появится 1 Гранд в обмен на энергию в Аккумуляторе, и так по кругу. <br>\
6 минут заряда аккумулятора = 1 Гранду.<br>\
<i class="fa fa-info-circle"></i> Более подобно можно ознакомится в самом меню внутриигровой валюты и левела во вкладке XP</p><br>\
<br>\
<blockquote class="pluginsheader"><center>Grand Bank.</center></blockquote>\
<p>Суть ивента проста, но задание слишком сложное.<br>\
На инкассатора, который перевозит электронные ключи от сейфа разработчиков, нападают.<br>\
Охрана отбивается от грабителей, и остаётся защищать груз.<br>\
Ваша задача найти груз инкассации, сделать это просто. В чате пишутся координаты места, локация отображается на G и M картах.<br><br>\
Избавьтесь от охраны. Поставьте ящик(и) на взлом и удерживайте позиции.<br>\
Ящики по стандарту взламываются <b>15 минут</b>. В одном ящике, хранится один электронный ключ от сейфа.<br>\
После того как взлом был произведён, постарайтесь залутать ключ. В момент когда вы заберёте ключ из одного ящика, все остальные снова блокируются. За это время у вас будет шанс спрятать электронный ключ в безопасности. \
Необходимо взломать все <b>4 ящика</b> и забрать в общей сумме <b>4 ключа</b>. Подсказка! Если вы забрали <b>3 ключа</b>, а четвёртый забрал кто-то другой, вы всегда можете попросить обменяться предложив что-то выгодное взамен.<br>\
После того как все <b>4</b> электронных ключа с нумерацией <b>1-2-3-4</b> будут находиться у вас, поместите их в стол для исследования. Если все карты рабочие, вам будут указаны координаты спрятанного сейфа. Добежав до места и открыв сейф, вы получите доступ к счёту.<br>\
После этого на ваш баланс в магазине упадёт неплохая сумма денег.<br>\
<i class="fa fa-info-circle"></i> Обязательно авторизуйтесь в магазине для получения баланса.<br><br></p><br>\
<br>\
</div>'
};

var aboutserversdub = '<li>Мощные анти-читы [AntiCheat]</li>\
<li>Отзывчивая Администрация</li>\
<li>Бесплатные оповещения о рейдах (/vk)</li>\
<li>Частые Ивенты [EVENTS]</li>\
<li>Ремув своих строений (8 часов с момента строения)[/remove]</li>\
<li>Блокировка оружия и взрывчатки после вайпа[/block]</li>\
<li>Цензура в чате [Censor]</li>\
<li>Внутриигровая карта (bind m map.open)</li>\
<li>Онлайн карта [RustIO:/map]</li>\
<li>Система телепортации [HOME]</li>\
<li>Наборы для новичков [Kits:Starter,Бомж,Med,Food,Hunt]</li>\
<li>Мгновенный крафт [InstaCraft]</li>\
<li>Блок телепорта в зоне рейда [NoEscape]</li>\
<li>Авто-апгрейд при постройке в зоне авторизации [Up]</li>\
<li>Картинки на таблички [/sil]</li>\
<li>Донат-наборы [STORE:Premium, WARS, ELITE, KING, GRAND]</li>\
<li>Вертолет каждые 4 часа</li>\
<li>Танк каждые 4 часа</li>\
<li>Корабль каждые 4 часа</li>\
<li>Чинук каждые 4 часа</li>\
<li>Автоматические ивенты</li>\
<li>Переработчик Редких Металлов (ПРМ)</li>\
<li>Способности на сервере прокачиваемые за опыт</li>\
<li>Супер игра в которой могут принять участие все желающие</li>\
<li>Внутриигровой магазин с покупкой вещей за опыт</li>\
<li>Майнинговая ферма грандов (внутриигровой валюты)</li>\
<li>Кейсы с внутриигровым складом</li>\
<li>День длится 55 минут, Ночь 3 минуты</li>\
<li>Запрещено строить дома в текстурах и монументах</li>';

curcontent["serv"] = {
	xhead: 'О серверах',
	xcon: '<div class="xbox aboutus" style="padding: 0px 20px;">\
	<h4>Основная информация</h4>\
	<div class="xbox aboutus_main">Модифицированные сервера для комфортной игры в Rust Experimental. Самое новое железо сервера и мощный хостинг с DDOS защитой помогут вам провести время у нас с удовольствием.<br><br>\
Тщательно настроенные модификации сервера, отличные плагины и правильная сборка сервера поможет вам ощутить все прелести Раста на себе и к тому же получить незабываемый опыт игры.<br><br>\
Мы попытались разнообразить геймплей для вас и привнести что-то новое в игру.<br>Хватит читать, заходи и попробуй сам:</div>\
\
<h4 class="serverheader">GRAND RUST#1 Procedural Max 1 </h4><p class="ipconnect">connect 1.grand-rust.ru:10000<a href="steam://connect/1.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Разрешено играть только соло</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#2 Procedural Max 2 </h4><p class="ipconnect">connect 2.grand-rust.ru:10000<a href="steam://connect/2.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в 1+1 [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#3 Barren Max 2 </h4><p class="ipconnect">connect 3.grand-rust.ru:10000<a href="steam://connect/3.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в 1+1 [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#4 Barren Max 3 </h4><p class="ipconnect">connect 4.grand-rust.ru:10000<a href="steam://connect/4.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#5 Procedural Max 3 </h4><p class="ipconnect">connect 5.grand-rust.ru:10000<a href="steam://connect/5.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li><b>Новейшее железо сервера</b></li>\
<li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в 3 [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#6 Procedural Max 2 </h4><p class="ipconnect">connect 6.grand-rust.ru:10000<a href="steam://connect/6.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li><b>Новейшее железо сервера</b></li>\
<li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в 1+1 [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
<br>\
<h4 class="serverheader">GRAND RUST#7 Procedural No Limit </h4><p class="ipconnect">connect 7.grand-rust.ru:10000<a href="steam://connect/7.grand-rust.ru:10000" title="Подключиться к серверу"><i class="fa fa-play"></i></a></p>\
<ul><li><b>Новейшее железо сервера</b></li>\
<li>Рейты x2, Стаки</li>\
<li>Рейты печек х3</li>\
<li>Система друзей - разрешено играть в тиме [Friends,FF,HitMarker]</li>\
'+ aboutserversdub +'\
</ul>\
</div>'
};



curcontent["Oplata"] = {
	xhead: 'Пополнение баланса',
	xcon: '<div class="xbox oplata_info"><form onsubmit="return qiwiHandler(event)" id="qiwi-inp-form" method="get" target="_blank" action="https://oplata.qiwi.com/create">\
<div class="qiwi-inp-main">\
	<div class="qiwi-widget-title">Пополнить с QIWI</div>\
	<div class="qiwi-inp-box">\
			<label for="qiwi-donation-amount" class="qiwi-label">Cумма</label>\
			<div class="qiwi-rub">₽</div>\
			<input type="tel" id="qiwi-donation-amount" name="amount" required="" value="">\
			<input type="hidden" id="qiwi-donation-comment" name="comment" value="Автоматическое пополнение через QIWI Grand Rust Аккаунт">\
			<input type="hidden" name="publicKey" value="48e7qUxn9T7RyYE1MVZswX1FRSbE6iyCj2gCRwwF3Dnh5XrasNTx3BGPiMsyXQFNKQhvukniQG8RTVhYm3iPpUQmfaEpAhq21XR23R28hYHpLoCdSST3kVCoiwxCzz1qWreJPpkHz4L8uoKbBGkMr4MGHdUzc1F49BAKbmA9Jyt9BBQodFG3RLUYfKUT8">\
			<input type="hidden" id="qiwi-donation-account" name="account" value="0">\
			<input type="hidden" name="customFields[themeCode]" value="Svetlana-S-vh5ib6hm">\
			<input type="hidden" name="successUrl" value="https://shop.grand-rust.ru">\
			<div class="qiwi-error-box" id="qiwi-error-box"></div>\
	</div>\
	<div class="qiwi-button-box">\
		<button class="qiwi-submit-main" id="qiwi-submit-main" width="159px" type="submit">Оплатить</button>\
	</div>\
</div>\
</form>\
<a class="qiwi-inp-main qiwi-inp-other" id="qiwi-inp-other">\
	<div class="qiwi-widget-title">Другие способы</div><img class="qiwi-inp-other-img" src="https://pic.moscow.ovh/images/2020/12/24/08a847e9d7f387ec60b4b3c89a8879e9.png">\
</a></div>'
};



var BlockListArrays = [['pistol.revolver', 'shotgun.double'], 
['pistol.python', 'pistol.semiauto', 'flamethrower', 'coffeecan.helmet', 'roadsign.kilt', 'roadsign.jacket'], 
['shotgun.pump'], 
['rifle.semiauto', 'smg.mp5', 'shotgun.spas12', 'pistol.m92', 'smg.thompson', 'smg.2', 'metal.facemask', 'metal.plate.torso', 'heavy.plate.helmet', 'heavy.plate.jacket', 'heavy.plate.pants'],
['rifle.ak', 'rifle.bolt', 'rifle.lr300', 'rifle.l96', 'rifle.m39', 'ammo.grenadelauncher.he'], 
['lmg.m249', 'grenade.f1', 'grenade.beancan', 'explosive.satchel', 'surveycharge', 'ammo.rifle.explosive'], 
['explosive.timed', 'rocket.launcher']];


curcontent["block"] = {
	xhead: 'Блокировка оружия и взрывчатого после вайпа',
	xcon: '<div class="xbox_custom_block"><div class="kit-items">'
	
};



function Open(el, usefade = true, zind = false) {
	closepage();
	var div1 = document.createElement("div");
	if(zind) div1.style = 'position: relative;';
	else div1.style = 'position: relative; z-index: 2;';
    div1.id = 'Modal';
	var div2 = document.createElement("div");
	div2.className = 'modal fade';
	if(!usefade) div2.classList.add("show");
	div2.style = 'display: block;';
	div2.id = 'closer';
	//div2.onclick = closepage;
	var div3 = document.createElement("div");
	div3.className = "modal-dialog modal-lg";
	if(el=="block")div3.className+=" modal-lg-block"
	var div4 = document.createElement("div");
	div4.className = "modal-content";
	var div5 = document.createElement("div");
	div5.className = "modal-header";
	div5.innerHTML = '<h4 class="modal-title">'+curcontent[el].xhead+'</h4>';
	var div6 = document.createElement("div");
	div6.className = "modal-body";
	div6.innerHTML = curcontent[el].xcon;
	var div7 = document.createElement("div");
	div7.className = "modal-footer";
	div7.innerHTML = '<center><button class="btn btn-danger" id="closer" onclick="closepage()">Закрыть</button><center>';
	var div8 = document.createElement("div");
	div8.className = "modal-backdrop fade show";
	
	div1.appendChild(div2);
	//div2.appendChild(div2_5);
	div2.appendChild(div3);
	div3.appendChild(div4);
	div4.appendChild(div5);
	div4.appendChild(div6);
	div4.appendChild(div7);
	div1.appendChild(div8);
	if(usefade) setTimeout(()=> div2.classList.add("show"), 0);
	
	var body = document.getElementsByTagName('body')[0];
	body.appendChild(div1);
	body.className = "modal-open";
}


function closepage(){
	var Modal = document.getElementById('Modal');
	var Modalparent = null;
	try{ Modalparent = ((Modal.parentElement) ? Modal.parentElement : ((Modal.parentNode) ? Modal.parentNode : null));}catch (err){return;}
	if(Modalparent == null)return;
	Modalparent.removeChild(Modal);
	document.getElementsByTagName('body')[0].className = "";
}

function search(e){
	if (e.offsetX < 1) { 
		console.log(e.target.innerText + ' | ' + e.clientX);
		if (document.selection) { // IE
			var range = document.body.createTextRange();
			range.moveToElementText(e.target);
			range.select();
		} else if (window.getSelection) {
			var range = document.createRange();
			range.selectNode(e.target);
			window.getSelection().removeAllRanges();
			window.getSelection().addRange(range);
		}
		try {
			var successful = document.execCommand('copy');
			var msg = successful ? 'successful' : 'unsuccessful';
			console.log('успешно скопирован, нажмите CTRL + V чтобы вставить в консоль F1 в игре.'); 
		  } catch (err) {
			console.log('Oops, unable to copy' + err);
		  }
    }
}


var CustomerSteamId = "0";
var OvhPayUrl = "";

function qiwiHandler(e){
	//e.preventDefault();
	var inputval = document.getElementById('qiwi-donation-amount').value;
	var inputfloat = parseFloat(inputval).toFixed(2);
	if(inputfloat < 1 || inputfloat > 15000 || isNaN(inputfloat)){
		document.getElementById('qiwi-error-box').innerText = "От 1 до 15000 RUB";
		e.preventDefault();
		return false;
	}else{
		document.getElementById('qiwi-error-box').innerText = "";
	}
	document.getElementById('qiwi-donation-amount').value = inputfloat;
	if(CustomerSteamId == "0" || CustomerSteamId == ""){
		document.getElementById('qiwi-error-box').innerText = "Пожалуйста авторизуйтесь в магазине!";
		e.preventDefault();
		return false;
	}
	qiwiFormHandle();
	
	
	
	
	return null;
}

function qiwiFormHandle(){
	var qiwi_comment = document.getElementById('qiwi-donation-comment');
	qiwi_comment.value = "Автоматическое пополнение через QIWI Grand Rust Аккаунт " + CustomerSteamId;
	document.getElementById('qiwi-donation-account').value = CustomerSteamId;
	document.getElementById('qiwi-inp-other').setAttribute("href", OvhPayUrl);
}

function OvhUrlOverrite(){
	var slides = document.getElementsByClassName("nav-link");
	for (var i = 0; i < slides.length; i++) {
		var elelink = slides.item(i);
		var urlelelink = elelink.getAttribute("href");
	   if(urlelelink.startsWith('https://pay.moscow.ovh')){
		   OvhPayUrl = urlelelink;
		   console.log(OvhPayUrl);
		   elelink.setAttribute("href", "javascript:;");
		   elelink.setAttribute("onclick", "OpenOplata()");
	   }
	}
}

function obtainShopSteamId(){
	if(CustomerSteamId != "0" && CustomerSteamId != ""){
		return;
	}
	var xmlHttp = new XMLHttpRequest();

        if(xmlHttp != null)
        {
            xmlHttp.open( "GET", "/api/index.php?modules=users&action=getData", true );
            xmlHttp.send( null );
        }
		xmlHttp.onload = function(gjson) {
			var gjson = JSON.parse(xmlHttp.response);
          console.log(gjson);
			var preSteam = gjson.data.steamID;
			OvhPayUrl = "https://pay.moscow.ovh/?"+gjson.data.pay;
			if(preSteam > 76561100000000000 || !isNaN(preSteam)){
				CustomerSteamId = preSteam.toString();
				//qiwiFormHandle();
				OvhUrlOverrite();
			}else{
				console.log("error obtainShopSteamId! "+ gjson);
			}
		}

}

function OpenOplata(){
	Open('Oplata');
			qiwiFormHandle();
	setTimeout(() => function () {
		try{
			qiwiFormHandle();
		}catch(e){
			console.log('element not found '+ e);
		}
	}, 3000);
}

var DOMReady = function(a,b,c){b=document,c='addEventListener';b[c]?b[c]('DOMContentLoaded',a):window.attachEvent('onload',a)}
window.addEventListener("load",function () {
	try{
		obtainShopSteamId();
	}catch(e){
		console.log('element not found '+ e);
	}
});


DOMReady(function () {
//window.onload = function () {
	
	try{
		setTimeout(() => obtainShopSteamId(), 6000);
	}catch(e){
		console.log('element not found '+ e);
	}
	
	//setTimeout(() => CheckDisCounter(), 5000);
	
	document.body.onclick=function(event)
	{
		if(event.target.id == 'closer')closepage();
		if(event.target.className == 'MsoCommand')search(event);
	}
	
	for (var i = 0; i < BlockListArrays.length; i++) {
		curcontent["block"].xcon += '<div class="block_by_category block_category_'+ (i + 1) +'">';
		for (var b = 0; b < BlockListArrays[i].length; b++) {
			/* if(b == 5 && i == 4)
			curcontent["block"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://rustlabs.com/img/items180/ammo.grenadelauncher.he.png">\
										<div class="kit-item__quantity block-lvl-'+ (i + 1) +'"></div></div></div>';
			else */
			curcontent["block"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ BlockListArrays[i][b] +'.png">\
										<div class="kit-item__quantity block-lvl-'+ (i + 1) +'"></div></div></div>';
		}
		curcontent["block"].xcon += '</div>';
	}
	curcontent["block"].xcon += '</div>\
	<br><i class="fa fa-info-circle"></i> Внимание! Вся эта таблица так же доступна на сервере по команде /block для более подробного ознакомления с оставшимся временем до разблокировки!</div>';
	
	
	
	for (var i = 0; i < kit_prem.length; i+=4) {
		if(kit_prem[(i+1)] != null)
			curcontent["kit-prem"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png">\
										<div class="kit-item__quantity">x'+ kit_prem[(i+1)] +'</div></div></div>';
		else 
			curcontent["kit-prem"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png"></div></div>';
	
		if(kit_prem[(i+2)] != null)
			curcontent["kit-wars"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png">\
										<div class="kit-item__quantity">x'+ kit_prem[(i+2)] +'</div></div></div>';
		else {
			if(i==88)kit_prem[i] = "smg.thompson";
			curcontent["kit-wars"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png"></div></div>';
		}
	
		if(kit_prem[(i+3)] != null){
			if(i==92)kit_prem[i] = "ammo.rifle";
			curcontent["kit-elite"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png">\
										<div class="kit-item__quantity">x'+ kit_prem[(i+3)] +'</div></div></div>';
		}else {
			if(i==88)kit_prem[i] = "rifle.ak";
			curcontent["kit-elite"].xcon += '<div class="kit-items__item"><div class="kit-item"><img class="kit-item__image" src="https://static.moscow.ovh/images/games/rust/icons/'+ kit_prem[i] +'.png"></div></div>';
		}
	}
	curcontent["kit-prem"].xcon += '</div></div></div>';
	curcontent["kit-wars"].xcon += '</div></div></div>';
	curcontent["kit-elite"].xcon += '</div></div></div>';

//}
});
